[
    {
        "description": "Abaddon, the Lord of Avernus, is a melee strength hero known as one of the most versatile characters in Dota due to his rather low mana dependence, short spell cooldowns and a large number of viable item choices. His ability to help sustain his allies and himself plus his strong tower diving capacity give him solid lane presence. Many of his abilities offer a large sum of utility, which makes him a strong support hero. Mist Coil serves as both a single target nuke and heal that helps shift the sustainability of both allied and enemy heroes in a lane at his will, though sacrificing a portion of his own health. Aphotic Shield holds as one of the most useful abilities in the game, able to shield a target from some damage while also able to reflect said damage to a huge area. The most important aspect is how it is able to dispel many status effects such as slows and stuns. His other abilities allow him to become a mix between a semi-carry and tank. Abaddon's passive, Curse of Avernus, allows his attacks to not only slow down his enemy, but also increase the attack speed of any ally attacking the same target while also silencing the target after a set of attacks. With his ultimate, Borrowed Time, Abaddon is able to shift all non-HP-removal damage he receives into health. When not on cooldown, Borrowed Time may activate passively when his health falls under a certain threshold, even under the most dire situations. Due to his powerful spells and versatility, Abaddon is an excellent addition to any team.\n",
        "name": "Abaddon"
    },
    {
        "description": "Razzil Darkbrew, the Alchemist, is a melee strength hero whose alchemical prowess makes him a strange but versatile fighter. He is an unusual carry based upon transmuting killed creeps into large amounts of bonus gold, with both an early game and late game presence due to the enormous health regeneration from his ultimate and the first strike nature of his other spells. His low but balanced attributes and the sure promise of gold for items means he can be one of the most disparately built heroes in the game.\nUnstable Concoction is his main contribution early on, dealing good damage and a lengthy stun. Acid Spray allows him to rapidly clear waves of creeps for his Greevil's Greed to contribute massive amounts of extra income. A well-equipped Alchemist can then use Chemical Rage to its fullest effect, as the incredible regeneration and base attack time reduction make it one of the best steroid abilities in the game.\n",
        "name": "Alchemist"
    },
    {
        "description": "Mogul Khan, the Axe, is a melee strength hero, infamous for creating chaos in battle and thriving off of it.\nAxe is commonly played as an initiator, as his potent disables can disrupt the enemy's formation and give his team openings in fights. Axe's fighting style demands that he gets up close and very personal, as he can taunt enemies into attacking him with Berserker's Call, preventing them from engaging his teammates and granting him a huge amount of bonus armor. Once he has the enemy's attention, he can counter those who strike him with a sweeping Counter Helix that slashes all enemies at melee range with pure damage. He also has a slow and damage-over-time nuke in Battle Hunger, which can harass the enemy or force them to join in battle, while also slowing their movement speed and boosting his own. Finally, he has the ability to unconditionally remove weakened enemies from the battlefield if they are under a certain threshold with Culling Blade, while simultaneously boosting his allies' speed. A bloodthirsty and indomitable warrior, Axe's presence on the battlefield is felt by friend and foe alike, dominating the attention of the enemy wherever he goes.\n",
        "name": "Axe"
    },
    {
        "description": "Karroch, the Beastmaster, is a versatile melee strength hero most commonly played as an offlaner and ganker who brings a good amount of utility to his team in any situation. His Wild Axes allows him to lane and farm quite effectively throughout the game, even when pressured. He is able to summon a hawk and boar to aid him, each providing a good amount of utility to his team. Hawks provide free flying vision around the map, scouting his enemies while his Boars can harass and slow his enemies to a crawl while aiding him in combat. His Inner Beast aura makes his team a force to be reckoned with, providing a hefty boost to attack speed to himself, his summons, and all nearby allies. Finally, his ultimate, Primal Roar, is the longest lasting single-target reliable stun in the game and also penetrates spell immunity (being only counterable by Linken's Sphere), providing a strong initiation for his team to claim a kill. With these skills, he can push enemy towers quickly and safely, take down undefended targets with the help of Necronomicon summons, lock down a single target, and also kite enemies in teamfights. With careful observation of the battlefield, Beastmaster takes down enemies one by one and paves the way to victory.\n",
        "name": "Beastmaster"
    },
    {
        "description": "Mangix, the Brewmaster, is a melee strength hero that can fill almost any role, though he is primarily seen as a carry, ganker, tank or initiator. He fits well into any lane, but is very experience dependent, which means he is often seen on the offlane or the midlane. His core abilities make him a respectable physical damage dealer and an especially good duelist since he has abilities that involve negating opposing attacks while strengthening his own. However, his true power lies in his ultimate, Primal Split, which, if used properly, can by itself turn the tide of a team fight. Each of the three aspects of the Brewmaster are exceptionally powerful, with exceptional disables, survivability against magic and physical attacks, and damage; they are also able to charge recklessly into the enemy since the damage they take is not permanent, and very rarely will all three die before Primal Split ends. For this reason, Brewmaster is almost always built to fully maximize the potential of this ultimate, getting items such as Blink Dagger so that he can combo into his ultimate without risk of being initiated on, Heart of Tarrasque to ensure he can survive the first wave of stuns and burst in order to cast his ultimate, and of course Aghanim's Scepter to give Brewmaster two charges of Primal Split and a possibility to cancel it at any time.\n",
        "name": "Brewmaster"
    },
    {
        "description": "Rigwarl, the Bristleback, is a melee strength hero famous for his array of synergistic, simplistic, and yet effective spells with low mana costs and cooldowns. Though each cast of his spells has relatively weak potency on its own, their instances have a cumulative effect, making the Bristleback quite deadly the longer he stays alive in a fight; this is directly reflected in his ultimate, Warpath, which powers up his movement and attack damage based on the number of spells he recently cast. He is able to increasingly slow his enemies down and reduce their armor with Viscous Nasal Goo and hit them with a barrage of Quill Sprays, making him an effective chaser when ganking enemies. His low strength gain makes him seem less tanky than most strength heroes at first glance, but his signature Bristleback passive substantially reduces all damage he takes from the sides and especially the rear, making him very difficult to bring down if he's facing away from his enemies. In the right hands, Bristleback is a powerful ganker in the early stages of the game, and a powerful hard carry in the later stages depending on how much farm he gets.\n",
        "name": "Bristleback"
    },
    {
        "description": "Bradwarden, the Centaur Warrunner, is a melee strength hero whose natural place in combat is right in the center of battle. His abilities stop enemies around him in their tracks and inflict heavy damage, making him an excellent initiator. He is also a powerful tank, having the highest strength gain in the game.\nBradwarden has immense natural health, and his skills' area of effect means that he can charge into combat and incapacitate groups of enemies at a time. Hoof Stomp and Double Edge make a great combo of stunning and burst damage on short cooldowns and his Retaliate means instant retaliation on enemies who try attack him, as well as his nearby allies with the proper late-game talent. His ultimate, Stampede effectively turns the entire team into initiators, granting them high speed and the ability to flatten enemies under as they pass over them.\nAlthough he is usually not played as a carry, he can scale powerfully with items, becoming a hard-hitting semi-carry that is nearly impossible to kill.\n",
        "name": "Centaur Warrunner"
    },
    {
        "description": "Chaos Knight is a melee strength hero with one of the highest physical damage output ceilings of all heroes. He is mostly played as a carry and ganker. As his name implies, he has a theme based on randomness and uncertainty. His regular attack has an incredibly wide thirty damage spread, making his last hitting ability somewhat unreliable. Chaos Bolt is his most notorious luck-based ability which, at max level, can stun a target anywhere between a mediocre 2 seconds to an effective 4 seconds that will almost certainly assure the target's death; it will also deal a variable amount of damage ranging from minuscule to moderate. Reality Rift pulls Chaos Knight and his target to a predetermined point along the line between the two and reduces the foe's armor. Chaos Strike is a crit-based ability with a proc chance and has random damage values. The four illusions produced by his ultimate Phantasm, that can deal up to his full attack damage at max level, benefit from his Chaos Strike and can teleport alongside him to attack the target whenever he uses Reality Rift. This allows Chaos Knight's physical damage output to be multiplied by up to four during teamfights later in the game, and it is not uncommon to see enemy heroes being killed instantly after being Reality Rifted by the apocalyptic horsemen. Thus, Chaos Knight is played as a carry who excels in both the mid and late game, if the game drags on long enough and he is able to acquire enough strength-based and survivability items to ensure that his illusions can stay alive, he will be able to overpower most hard carries and potentially wipe out an entire team by himself.\n",
        "name": "Chaos Knight"
    },
    {
        "description": "Rattletrap, the Clockwerk, is a melee strength hero known as being one of the most well-rounded initiator-gankers in the game. Rattletrap's wide array of disables and nukes allows him to cause chaos among the enemy team and break up their formation, giving his team a powerful advantage in any fight. Battery Assault allows Clockwerk to inflict repeated damage ticks and mini-stuns on nearby enemies, allowing him to constantly hinder any enemies he manages to get close to and single out. He can also disrupt enemy movement and pen in foes with his Power Cogs, which induces an electric shock to foes outside, stunning them while damaging them and burning their mana, and can render enemies caught inside helpless. His damage nuke, Rocket Flare, gives him global nuking power that also provides scouting vision for him and his team. Finally, his ultimate, Hookshot, allows Rattletrap to instantaneously latch onto and stun a foe from long range, making him a very strong ganker. Few can escape Clockwerk once he has his sights locked in, and his machinations make him a powerful ally to have on any team.\n",
        "name": "Clockwerk"
    },
    {
        "description": "Valora, the Dawnbreaker, is a melee strength hero that shines in the heart of battle, happily crushing enemies with her celestial hammer and using the energy released to heal nearby allies. At one with the mass of her weapon, she revels in hurling her hammer through multiple foes and then converging with it in a blazing wake. Created to rival ancient forces of chaos and darkness by descendants of the first light, Dawnbreaker only taps her true cosmic power to fly to the aid of her teammates — eager to rout her enemies on the battlefield no matter where they may be.\n",
        "name": "Dawnbreaker"
    },
    {
        "description": "Lucifer, the Doom, is a melee strength hero with strong farming capabilities, good versatility, and one of the strongest single-target disables in the game. His very low starting armor makes him vulnerable to harassment, but his abilities and high health allow him to lane or even jungle quite effectively. A ruthless demon, Doom possesses malicious abilities revolving around greed, fire, and death. His Devour ability allows him to consume creeps, providing additional gold and allowing him to absorb their powers, using them to increase his own strength. Because there are numerous neutral creep abilities to choose from to supplement his other abilities, the role that he chooses to play is quite flexible. Scorched Earth allows him to chase or escape effectively, all while slowly burning his enemies. He can deal tremendous damage with Infernal Blade, an attack modifier which mini-stuns enemies and deals damage over time, based on their maximum health, making it a powerful nuking ability that scales into the late game. Finally, his namesake ultimate Doom serves as one of the strongest single-target lockdown abilities in the game. A unit afflicted with Doom takes intense damage over a lengthy duration while having all its active abilities - even those from items - completely silenced. With numerous expensive items in his arsenal and a key enemy hero rendered useless for a teamfight, a farmed Doom ensures that nobody can extinguish his flame.\n",
        "name": "Doom"
    },
    {
        "description": "Davion, the Dragon Knight, is a durable melee strength hero with a relatively straightforward and yet versatile skill set. He has both an area-of-effect nuke and a lengthy single-target stun, giving him excellent farming and ganking capabilities. Though he has no real escape ability, his Dragon Blood provides him a hefty amount of armor and regen, making him capable of withstanding strong physical hits and recovering quickly. He is still very vulnerable in the early game, however, and needs to farm and stay alive in order to be effective in later stages. If he has enough levels and farm, Dragon Knight is very formidable in the late game due to his strong ultimate, Elder Dragon Form, which transforms him into a legendary dragon with a ranged attack, capable of eliminating multiple enemies at once.\n",
        "name": "Dragon Knight"
    },
    {
        "description": "Kaolin, the Earth Spirit, is a melee strength hero with great utility, possessing a wide array of disables in all of his basic abilities.\nUnlike most heroes, his abilities revolve around an innate ability, Stone Remnant, which allows him to place statues that can be used to augment his abilities. Using his abilities in tandem with these remnants, Earth Spirit can slow enemies with Boulder Smash, stun them and initiate with Rolling Boulder, and silence them with Geomagnetic Grip. His ultimate, Magnetize, inflicts nearby enemies with a damage over time debuff, and allows him to spread the slow and silence from his abilities to other nearby enemies while refreshing the debuff duration by using his Stone Remnants, stopping entire groups of enemies in their tracks. With good timing and skill he can initiate fights from a distance, and given the right circumstances can deal a surprising amount of damage to both single and multiple targets, all the while disrupting enemy positioning allowing for easy kills. A useful ally and a dangerous enemy, the Earth Spirit's versatility and flexibility make him an ideal hero in almost any lineup or lane.\n",
        "name": "Earth Spirit"
    },
    {
        "description": "Raigor Stonehoof, the Earthshaker, is a melee strength hero with several area of effect (AoE) disables, commonly played as a ganker or initiator. Good usage of his spells allow him to damage and chainstun multiple enemies at once, making him very disruptive in skirmishes and teamfights. His Fissure is a versatile long-ranged spell that affects enemies in a line, used to stun, inflict moderate damage, and create an impassable wall of earth for a significant duration. Proper usage of this can allows him to cut off chokepoints, leaving enemies with no escape routes or preventing them from chasing after endangered allies. Enchant Totem massively boosts his attack damage for one attack, and has a very short cooldown. Aftershock lets the Earthshaker deal additional damage and stun in a small area around him every time he uses one of his spells, and combos particularly well with Enchant Totem, given the former's very low cooldown. Earthshaker's heavy AoE-centric kit is most powerful when his enemies are in large numbers and in close proximity. With his Echo Slam, he can deal heavy damage to clusters of enemies. All of Earthshaker's spells (with the exception of his ultimate) have a long casting animation, but with proper positioning, an adept Earthshaker can wreak havoc. Blink Dagger is an essential item for him to be able to properly land Echo Slam within a cluster of enemies. At the same time, because of the high mana costs of his spells, he needs some form of mana sustenance. With his tremendous seismic power, the Earthshaker is never one that should be taken lightly even when he is heavily outnumbered.\n",
        "name": "Earthshaker"
    },
    {
        "description": "The Elder Titan is a melee strength hero who is renowned as a powerful area nuker and disabler.\nElder Titan is perhaps best known for his ability Astral Spirit, which sends forth an image of himself that damages enemies that it passes through, and upon returning to Elder Titan boosts his attack damage and movement speed, making him a fearsome melee fighter. Possessing a channeled sleep in Echo Stomp, Elder Titan is also capable of knocking out his foes for an extended period of time if they are caught within its radius; Astral Spirit also allows him to cast this ability and disable large groups of enemies from afar, making him one of the few initiators that does not require a Blink Dagger. This combination creates a perfect setup for his powerful ultimate Earth Splitter, which damages enemies based on their maximum HP and slows their movement speed. This, along with his ability to lower his enemies' physical and magical resistance with his Natural Order aura, makes Elder Titan scale well through his abilities and be effective at all stages of the game. As the progenitor of this world, Elder Titan reshapes the battlefield on a whim and can turn any teamfight in his favor.\n",
        "name": "Elder Titan"
    },
    {
        "description": "Huskar, the Sacred Warrior, is a ranged strength hero who is an effective ganker and carry, with both great benefits and risks offered. He is known to be a powerful adversary in most games because his damage-per-second attacks can easily kill almost all heroes at any point in the game, assuming no one is nearby to save them. Unlike many other heroes, Huskar does not require much mana to use his abilities; rather, he sacrifices his own health to inflict additional damage. His passive, Berserker's Blood, defines the power of sacrifice: Huskar gets more dangerous the more he gets hurt. This ability gives him increased health regen and attack speed depending on how much life he is missing. Combined with the DPS from Burning Spear, the increased attack speed from Berserker's Blood allows Huskar to output colossal damage, which can be used to gain an advantage over the enemies early on during the game. His Life Break is his most dangerous ability, but also his riskiest one: charging towards his target, Huskar sheds a large amount of his life force to cut an equal amount of the target's current health. This is great to use as an initiation spell as it deals a guaranteed percentage damage, allowing Huskar and his allies to feel the pain that the Sacred Warrior felt. Courageous and fearless, Huskar is powerful at any stage of the game and is willing to suffer and face death, for the greater good of taking his allies to victory.\n",
        "name": "Huskar"
    },
    {
        "description": "Io, the Wisp, is a ranged strength hero who works best as part of a communicative team. With its support-oriented skill set, Io can share its healing and buffs through Tether and Overcharge, harass enemy heroes out of the lane with Spirits, and materialize itself and an ally anywhere on the map with Relocate.\nGank enemy heroes, push undefended lanes, save teammates from deep within enemy territory—the possibilities are endless, and Io features one of the highest skill ceilings in the game.\nIo's facing direction is marked by an arc-like effect.\n",
        "name": "Io"
    },
    {
        "description": "Kunkka, the Admiral, is a versatile melee strength hero built with an arsenal of powerful area-of-effect (AoE) spells. Two of his active spells are nukes that have long delay times, but can disable and disrupt the enemies' position. He is mostly played as a carry, initiator, or even as a ganking support. Kunkka is known for his Tidebringer sword, giving him the ability to cleave a large area around him with heavy potential damage on his next attack, which refreshes at a given period of time. Torrent calls upon the element of water to rise and burst out, dealing damage, disabling them up high, and slowing them on impact. There's a delay on this ability before it activates, so Kunkka must be wise in using this ability. X Marks the Spot targets any hero or Kunkka himself to be marked on their current position, and after a given time delay, instantly returns to the marked spot. Useful in setting up tricky spells, escape prevention, or even saving allies, X Marks the Spot makes the Admiral a great battle strategist. His ultimate lets him summon a Ghostship, which travels on ground, until it crashes a set distance away, stunning and damaging enemies on that location – potentially crippling the enemy team. The Ghostship also bolsters allies with Kunkka's Rum, granting them bonus movement speed and temporary numbness to damage. Capable of inflicting high burst damage with his spells, controlling their position while being able to survive the mayhem when his spells are used properly, Kunkka is a mighty offensive team fighter, built with strong physical and magical damage output, who can indeed turn the tide of a battle.\n",
        "name": "Kunkka"
    },
    {
        "description": "Tresdin, the Legion Commander, is a melee strength hero fitting the role of carry. A highly mobile and somewhat tanky hero, her skillset and gameplay revolve mainly around killing off targets and especially backliners and supports, with her ultimate, Duel. Each successful Duel grants Tresdin permanent bonus damage. Though she is extremely skilled in \"fair\" one-on-one fights, Tresdin suffers when outnumbered and must choose her engagements carefully. A successful midgame sees her roaming the map, collecting kills and developing into a fearsome carry, so that by lategame she need no longer rely on duel to destroy any enemies that venture too close. Though potentially an extremely powerful hero, she must be played with premeditation and good decision-making to reach her full potential.\n",
        "name": "Legion Commander"
    },
    {
        "description": "N'aix, the Lifestealer, is a vicious melee strength hero whose abilities give him the power to bring down durable heroes quickly, while sustaining his health by leeching the very life of his enemies.\nThe main role of the Lifestealer is to fulfill the job of a formidable carry, he is able to do so by restoring his life through his abilities. Feast is his signature passive ability, every attack he lands consumes the flesh and blood of his victim, dealing bonus damage and regenarating N'aix based on how much health his enemies possess. Ghoul Frenzy is another passive ability that allows Lifestealer to slow enemies with his attacks, giving high sticking power. N'aix can send himself into a bloody Rage, increasing his movement speed, while granting a short period of spell immunity. When in need, N'aix can use Infest to hide himself inside his allies or any non-hero unit, laying dormant, until he is ready to come out, devouring the flesh from the inside, killing the non-hero unit, bursting out the chunks of flesh and bones of his unfortunate host, damaging foes around him and ambushing them with carnivorous savagery.\nThe Lifestealer is a monstrous beast of gluttony and greed, bent on stealing the lives of every living creature he encounters, violently killing them to sate the Lifestealer's terrifying thirst and hunger.\n",
        "name": "Lifestealer"
    },
    {
        "description": "Banehallow, the Lycan, is a melee strength hero who is capable of immense physical damage and considerable movement speed, who also excels at pushing buildings and bolstering his team's damage and health. He is capable of summoning Wolves who make excellent sources of damage and objective control. His Howl gives a large reduction in attack damage and armor to his enemies, while Feral Impulse turns Lycan and his pack into prime fighters on their own with bonus attack damage and health regeneration. When the time is right, Shapeshift allows the Lycan himself to join in the hunt, overwhelming foes with deadly critical strikes and incredible movement speed.\n",
        "name": "Lycan"
    },
    {
        "description": "Magnus, the Magnoceros, is a monstrous melee strength hero who is usually played as a ganker, initiator, or semi-carry. His ability to battle multiple heroes at once gives him an excellent presence in team fights. In addition to his teamfight presence, he can buff allies or himself with bonus damage and cleave, capitalizing on his ability to group up multiple enemies. As a hero who possesses multiple area-of-effect abilities with a manageable mana cost, and a very powerful ultimate that serves as a great team fight initiation ability, Magnus is truly a force to be reckoned with.\n",
        "name": "Magnus"
    },
    {
        "description": "Mars, the First Son of Heaven, is an aggressive melee strength hero who controls the battlefield with numerous knockbacks and impassable terrain. Equipped with a large shield, his Bulwark passively blocks attacks from the front and sides, making him a very durable fighter in most situations. The same shield allows him to smash enemies and knock them back, dealing critical damage that ignores all evasion. The Spear of Mars can be thrown at long range, piercing enemies to push them back, and stunning them upon contact with trees or terrain. Mars' most potent ability creates an Arena Of Blood, a circular zone where no enemy can exit or enter, as well as blocking enemy attacks from the outside. Used correctly, the Arena Of Blood can decisively split and cut off enemies from support during teamfights, making Mars a valuable asset to his team, as well as a highly dangerous opponent.\n",
        "name": "Mars"
    },
    {
        "description": "Balanar, the Night Stalker, is a melee strength hero, renowned for being a very potent ganker once night falls.\nUnlike most other heroes in the game, Night Stalker's strength greatly fluctuates depending on the time of day. He is relatively innocuous during the day, with one of his abilities being completely disabled then while two others are heavily weakened in potency, but he quickly becomes a force to be reckoned with once the moon rises. He has a slow in Void, which allows him to hound and nuke down lone enemies who are unfortunate enough to encounter him; the slow effect is considerably more debilitating at night where a mini stun is also applied. He also has the ability to silence his foes with Crippling Fear, which drastically increases in duration at night, preventing spellcasters and even carries from retaliating against him while he lashes at them with relative impunity. His passive, Hunter In the Night, greatly boosts his movement speed and attack speed at night, allowing him to easily move around the map, to pursue and tear apart his prey. Finally, his ultimate, Dark Ascension, summons instant nighttime and hampers enemy night vision, making even the strongest enemy heroes sitting ducks for the Night Stalker and his allies. A terror in darkness, Night Stalker is the embodiment of heroes' nightmares, and one of the last things they will ever wish to encounter alone at night.\n",
        "name": "Night Stalker"
    },
    {
        "description": "Purist Thunderwrath, the Omniknight, is a melee strength hero who is renowned for his ability to protect his allies, preventing the enemy from easily killing them. A holy and courageous hero, Purist Thunderwrath is an adept support whose powerful spells give his team strong survivability. He possesses a potent healing ability in Purification, which can instantly heal the targeted ally and, if there are nearby enemy units, deal pure damage in the same amount, allowing it to be used as a nuke. He is also capable of providing status resistance to allies in the form of Heavenly Grace, a basic ability that heals an ally over time, as well as greatly reducing the duration of enemy effects and granting bonus strength, making it especially useful for strength heroes. His passive ability, Degen Aura, can greatly slow the movement speed of enemies, preventing them from easily using their physical attacks to deal damage. And finally, his ultimate, Guardian Angel, can provide complete immunity against physical damage to all nearby allies, completely nullifying the damage output of most carries for a short time. Few can escape the mighty and heavenly power of the Omniknight and he is a powerful ally in team fights. He is a mighty tank, and a very difficult hero to kill.\n",
        "name": "Omniknight"
    },
    {
        "description": "Phoenix is a flexible and unique ranged strength hero with a plethora of powerful abilities that inflict heavy damage over time on its opponents at the cost of its own health. It can be played as either a support, initiator, or semi-carry. Icarus Dive can serve as either a harassment tool, an initiating maneuver, or an escape mechanism, all the while slowing and damaging opponents in its path, while its Fire Spirits burn and cripple the opponent's attack speed, making it a potent anti-carry. Sun Ray projects a powerful beam in front of Phoenix that burns enemies for a percentage of their maximum health while sacrificing some of its own health; and, if it ever sees fit, it can end its current life to turn into a searing Supernova. Surviving this stage of its life cycle allows Phoenix to reemerge in full strength, stunning all nearby opponents and with all non-ultimate and non-item cooldowns refreshed, ready to inflict havoc on its foes once again.\n",
        "name": "Phoenix"
    },
    {
        "description": "Pudge, the Butcher, is a melee strength hero feared for his incredible ganking prowess and risky, yet potentially rewarding playstyle.\nPudge is potentially one of the strongest gankers and disablers in the entire game, with his combo of three active abilities proving more than sufficient to kill fragile enemy heroes in the early and mid-game. His signature ability, Meat Hook, is a grapple that is thrown out in a straight line; if it snags a target, it will drag them back to Pudge, dealing enormous damage to it if it was an enemy. Although it can be difficult to land and often requires a good read on the enemy's movements, it is a very powerful ganking and initiation spell due to its ability to displace enemies, and also has the utility of being able to save an endangered ally. He can then follow up with his ultimate, Dismember, a channeled disable that deals further damage to the target over a few seconds and increases in lethality the more strength Pudge has, while also healing Pudge for its duration. During this period, he can activate Rot to deal even more damage while he is consuming his foe, and use it to slow and finish them off if they survive the initial assault. Rot is also a very potent ability even from the start of the game, as it can slow an enemy to a crawl and be used indefinitely as long as Pudge keeps pace with the enemy, making Pudge a strong roamer. To supplement his killing power is Flesh Heap. The scariest aspect of Flesh Heap though, is that it provides him with a permanent strength bonus with every kill that he participates in, making him harder to kill and increasing the damage of Dismember as the game goes on. A skilled Pudge player is feared by many, as he can quickly snowball out of control, cripple the enemy team, and become an unstoppable behemoth of rotting flesh.\n",
        "name": "Pudge"
    },
    {
        "description": "Crixalis, the Sand King, is a melee strength hero with one of the highest area of effect (AoE) damage outputs in the entire game. All four of his abilities can affect multiple enemy units, and can combo quite well with each other. He is one of the most versatile Heroes in the game as he can push, initiate, support, gank, and even semi-carry if he does well. Late game his effectiveness diminishes as none of his abilities scale, but he can still function to support carries with Burrowstrike and Epicenter's slow. He is also versatile enough to be able to go to any lane with at least moderate success. He works well as a participant in a dual lane or trilane, but can also solo very effectively against melee enemies, since Caustic Finale discourages enemies from approaching the creeps. His main role in the team is to deliver a devastating initiation, delivering both stuns and slows to the enemy team. Crixalis is also very effective at escaping and dodging with two low cost, low cooldown abilities that disjoint projectiles and can escape enemy damage. Burrowstrike allows him to tunnel underground and resurface in a short line, dealing damage and stunning all targets it hits. Sand Storm is used as an escape mechanism and to do AoE damage. Caustic Finale serves as a strong harassing tool against enemy melee heroes or as a followup after he Burrowstrikes a creep wave, allowing him to farm quite effectively. Finally, his ultimate delivers a vast amount of AoE damage and slow centered around himself, though it necessitates a safe way to cast it due to its long cast time, like a Blink Dagger.\n",
        "name": "Sand King"
    },
    {
        "description": "Slardar, the Slithereen Guard, is a melee strength hero who uses brute force, low cooldown spells, and high physical strength to bring his enemies to their knees. He excels and thrives in close combat situations, and has high mobility, strong initiation and ganking abilities, and good synergy between his abilities. Guardian Sprint greatly increases Slardar's movement speed for a lengthy duration, and allows him to chase down heroes, and escape with ease. Guardian Sprint can be used to get right next to enemies so Slardar can use Slithereen Crush, which delivers an area of effect (AoE) stun to nearby enemies followed by a minor slow afterwards, all on a very low cooldown. This allows Slardar to take on multiple opponents simultaneously and deliver a potent initiation. Bash of the Deep serves as a strong steroid ability, occasionally locking enemies in place while Slardar whacks at them with impunity. Finally, his ultimate Corrosive Haze is a great armor reduction modifier and allows him to reveal an enemy for its duration, making Slardar very potent against tanks and invisible heroes alike. It will also increase the damage dealt by his Crush and Bash, since they are physical. Although a strength hero, he has a high physical damage output, and an agility gain and armor value which rivals that of most agility heroes, allowing him to carry quite well if the situation calls for it. Chasing enemies relentlessly, pummeling them into the ground, and reducing their armor to shreds, Slardar is a fearsome opponent to face.\n",
        "name": "Slardar"
    },
    {
        "description": "Beatrix Snapfire, or simply Snapfire,  is a ranged strength hero armed with a wide array of firepower, riding into battle on her dragon toad Mortimer. Her powerful Scatterblast blasts foes who get too close, while her mounted turret increases her range, allowing her to unleash a barrage of rapid fire attacks. Snapfire's coveted Firesnap Cookies give allies a boost, allowing them to leap a short distance. The cookies aren't her only secret weapon, as her dragon toad has the ultimate nasty surprise for the enemy team—a long range artillery barrage of Mortimer Kisses that coats the map in searing lava.\n",
        "name": "Snapfire"
    },
    {
        "description": "Barathrum, the Spirit Breaker, is a powerful ganker-type melee strength hero that excels at focusing on and taking out lone targets in skirmishes, while lacking presence in larger team fights. His Charge of Darkness lets him charge rapidly towards any enemy visible on the map, while knocking off all enemies in his path. If you see the charge coming, it may already be too late. Bulldoze provides him with bonus movement speed and status resistance in order to easily chase his opponents while reducing the duration of most disables. He is picked mostly for his high damage given by his Greater Bash which crushes the life out of his helpless victims (and stuns them). Barathrum can instantly and quickly move to his enemy via Nether Strike and shock them with a soul-bashing blow. Tanky, mobile and with an array of high-damage knockbacks, including a passive one attached to his right clicks, Spirit Breaker's ganking capabilities are second to none.\n",
        "name": "Spirit Breaker"
    },
    {
        "description": "Sven, the Rogue Knight, is a versatile melee strength hero with superior physical power coupled with powerful utility abilities. He can fulfill various roles, but is often played as a semi-carry due to his high utility even without items. He possesses a versatile arsenal, from Warcry, which hastens allies and shields them from attacks, to the throwable Storm Hammer that stuns enemies around the targeted unit. With enough items, Sven has the potential to be a strong late-game carry due to his ultimate, which increases his damage, making him hit up to three times as hard, which can then be used in conjunction with his Great Cleave to secure multiple kills with just a few swings of his sword. This immense power granted to him solely by his ultimate makes him one of strongest late-game carries in the game, and arguably the strongest semi-carry of all, as his killing presence remains even if he decides to build more supportive and tanky utility items. A truly frightening enemy to go up against if farmed, strong and versatile, Sven is a solid addition to almost every team composition.\n",
        "name": "Sven"
    },
    {
        "description": "Leviathan, the Tidehunter, is a melee strength hero who is formidable due to his uncommonly tough hide and his ocean spells that sweep enemies upward. He can be played as a support or as an offlane hero whose greatest strengths lie in being able to take heavy amounts of damage in the early game and the disabling powers of his spells.\nThough he does not deal especially high damage at any point in the game, his spells can have a devastating effect on the enemy without expending much mana. He is able to send forth a spray of water to slow down the enemy retreat and his outrageous ultimate, Ravage, throttles enemies in a massive area around him. The durability of his Kraken Shell allows him to shrug off damage for absurd survivability against low damage attacks. Tidehunter's ability to shrug off damage and his enormous strength gain makes him very durable.\n",
        "name": "Tidehunter"
    },
    {
        "description": "Rizzrack, the Timbersaw, is a melee strength hero that excels in dealing damage and causing destruction in large areas. His effectiveness is highly dependent on the presence of trees in the surrounding environment, as they can amplify the damage of his spells and allow him to escape and chase easily. He is not naturally very durable, having relatively low health for a strength hero and almost nonexistent armor from the start of the game, but becomes far more resilient when he has been repeatedly attacked due to his Reactive Armor, providing him both with a hefty amount of armor and regeneration. This can make him a huge nuisance to deal with in the early and midgame, when spell damage output is low from enemies and they are reliant on physical attacks to harass him. His three active abilities all have very low cooldowns and the capacity to deal pure damage, which is not reduced by magic resistance or armor, making him a very destructive hero if left to his own devices. Whirling Death deals damage to enemies in a small area around him, and will deal bonus damage if trees were cut down with its usage; it also lowers the primary attributes of the afflicted, being especially effective against enemy strength heroes as they lose a portion of their maximum health pool. Timber Chain serves as a multipurpose mobility and damage spell, allowing him to quickly close distant gaps between himself and enemies and escape, but requires a tree to latch onto. Finally his ultimate, Chakram, can deal considerable pure damage and slow all at a very low cooldown, but can be difficult to land. With proper positioning and timing, he can cause massive damage to multiple enemies all the while debilitating their attributes and movement.\n",
        "name": "Timbersaw"
    },
    {
        "description": "Tiny, the Stone Giant, is a melee strength hero with powerful ganking and killing potential. Although he starts off vulnerable in lane with his pitiful mana pool and non-existent armor, with a few levels, he gets considerably stronger. His killing power in the early and midgame comes from combo-ing his two active abilities. Avalanche engulfs an area in a wave of stones, dealing respectable damage and stunning enemies, while Toss allows Tiny to pick up the closest unit near himself and launch it at the designated location, dealing damage to all enemies at the location as well as additional damage to the thrown unit if an enemy. It can be used to displace an ally within the enemy team, but is mostly used on enemies themselves to deliver massive damage. If chained immediately with Avalanche, it also triples the damage the target takes from Avalanche, allowing Tiny to easily dispatch fragile enemy heroes in a matter of seconds. Tree Grab lets Tiny use a tree to smack his enemies, dealing splash damage and makes Tiny a formidable pusher with its bonus damage against buildings. Furthermore, should his weakened enemies attempt to escape, Tiny can simply use his Tree Throw to finish them off. Although his nuking potential with his active abilities is already considerable, his ultimate Grow turns Tiny into a formidable physical combatant as well. Grow increases Tiny's size and provides him with a massive boost to his attack damage and armor at the cost of some attack speed. Although Tiny initially lives up to his name by starting off small and weak, much like an avalanche, he quickly grows in size and strength until he becomes a hulking behemoth with enormous health and damage output. This gives Tiny the potential to become one of the strongest carries in late game situations.\n",
        "name": "Tiny"
    },
    {
        "description": "Rooftrellen, the Treant Protector, is a melee strength hero who excels in supporting and strengthening his allies with his beneficial set of spells, which use the power of nature. He is a natural tank, offensively and defensively, having both the highest natural attack damage and the third highest overall strength in the game. Manipulating the power of the plants to his will, he can grant invisibility and stealth to himself with Nature's Guise and move quickier, being a good ganking skill and rather efficient for scouting, provided that he remains within close proximity to a tree. He can use Leech Seed to sap the life from a target, slowing and dealing moderate damage over time to it while nearby allies are replenished by the same amount. His signature Living Armor makes him truly live up his title, as he is able to provide allies and even friendly buildings with increased health regeneration and armour from anywhere on the map. Finally, his ultimate Overgrowth roots nearby enemies with vines, branches, and roots, it immobilizes them and renders them unable to attack for several crucial seconds while also damaging them over time. Although Rooftrellen is not able to dish out much damage outside of his regular attacks, he is able to provide an enormous amount of defensive utility and survivability to himself and his teammates, thereby planting the seeds for a decisive victory\n",
        "name": "Treant Protector"
    },
    {
        "description": "Ymir, the Tusk, is a melee strength hero whose array of icy disables makes him a very strong team initiator and ganker. He has a damage nuke and a disable in Ice Shards, which lets him precisely place a barrier in an enemy's path, inhibiting their movement and blocking off their escape path. Should his teammates need help closing the distance to enemies, Tusk can assist them with Snowball, which surrounds Tusk and any nearby allies in a protective shell of snow as he rolls at a target enemy, damaging and stunning everything in its path. Once in a fight, Tusk also has the ability to Tag Team, which allows all nearby allies to slow enemies they attack with physical damage. His ultimate, Walrus PUNCH!, sends a target enemy flying with a mighty uppercut, stunning and disabling them while dealing a critical strike and slowing them upon landing for a moderate amount of time. A strong initiator and powerful brawler, the Terror from the Barrier should never be bet against in a fight, as he can put his foes down for the count with his unique assortment of spells and disables.\n",
        "name": "Tusk"
    },
    {
        "description": "Vrogros, the Underlord, is a melee strength hero whose commanding presence is crucial to his team's success. With his long-lasting abilities, Underlord is able to control wide areas of the battlefield during teamfights and skirmishes. Raining down damage from afar with Firestorm, he clears out creeps and discourages enemies from approaching. With his ultimate, Dark Rift, he can teleport his entire team across the map, taking enemies by surprise, pushing in lanes while the other team is dead or out of position. He can also use it as an escape mechanism, bringing himself and his own team to safety in a dicey situation. Enemies' base attack damage are reduced around Underlord by his Atrophy Aura, making him and his team far more durable when dealing with physical damage. The aura also provides him with damage with the death of nearby enemy creeps and heroes, making him an excellent laner and a strong pusher after a won teamfight as well. One of the best area disables in the game, Pit of Malice presents a very large obstacle for enemies, especially melee attackers. With it, Underlord can repeatedly ensnare multiple enemies at once, making him a potent and disruptive opponent in any teamfight.\nDeep below the surface of the world lay unknown wonders and horrors. Down and down again, well beneath the slithering magma fields and simmering roots of dormant volcanoes stands the obsidian city of Aziyog, its incomparable stonework spanning an endless cavern. Within honeycomb walls mortared with the bones of countless slaves lies the domain of the Abyssal Horde, and their brutal underlord Vrogros.\n",
        "name": "Underlord"
    },
    {
        "description": "Undying, the Almighty Dirge, is a melee strength hero who serves as a formidable tank and a dangerous spellcaster. His abilities force opponents to either kill him or suffer powerful debuffs in a teamfight. Decay is a spammable ability that steals enemies' Strength in an area, making them more fragile and Undying himself more durable as the fight goes on while also being exceptionally potent during the early laning phase, leaving your opponents with mere scraps of health. Soul Rip can act as both a powerful heal or nuke, redirecting the flow of living energy to a target. By ripping some of the health of his ally or enemy in an area, the target can be healed if an ally, or damaged if an enemy. This is empowered by Tombstone, which acts as a static tank by summoning zombies to slow Undying's foes while active. With the zombies summoned, Soul Rip can perform to its fullest, while Decay weakens Undying's foes. Finally, Undying can transform into a horrific Flesh Golem. This transformation makes him substantially more tanky while allowing his attacks to place a debuff that both slows and amplifies all subsequent damage to the target. Monstrous and truly horrifying, Undying finds great pleasure in keeping himself alive and vital, while his adversaries suffer as he delivers death to the field. With powerful abilities that allow him to perform well in large fights, the Dirge may never cease.\n",
        "name": "Undying"
    },
    {
        "description": "Ostarion, the Wraith King, is a melee strength hero, as well as a carry and tank, capable of both dealing and taking plenty of damage. His infamous Reincarnation allows the Wraith King to rise again after death, acting like an Aegis of the Immortal, making him especially difficult to kill. But if left alive, the Wraith King can wreak havoc upon his enemies; his Wraithfire Blast provides reliable damage and a stun on a short cooldown, Vampiric Spirit grants himself sizeable lifesteal and passively helps make short work of foes, while its active allows for quick pushing. Mortal Strike is a guaranteed critical strike that triggers every few seconds and is Wraith King's primary form of high sustained damage, especially in the lategame, once he has enough farm and levels. A lumbering and straightforward hero, Wraith King can nonetheless be a become a terrifying lategame carry who is nigh-immortal if left unchecked.\n",
        "name": "Wraith King"
    },
    {
        "description": "Anti-Mage, is a fast melee agility hero with an emphasis on disrupting and killing high-mana enemies. He has notably high agility and low base attack time, giving him high damage and scaling with his basic attacks. His signature ability is Mana Break, a passive attack modifier that makes him a huge threat to mana-reliant heroes, mainly Intelligence-based casters. In addition to granting substantial bonus damage on each attack, its mana burn sets enemies up to be devastated by his ultimate ability, Mana Void. Blink is a highly versatile ability that allows Anti-Mage to instantly teleport short distances, thereby allowing him to escape, chase, and even farm with ease. Combined with his high base movement speed, this makes Anti-Mage a highly mobile hero at all points in the game. Counterspell greatly increases Anti-Mage's magic resistance, allowing him to sustain more damage from enemy casters. Finally, Mana Void finishes off targets after their mana has been burned, inflicting heavy damage to both the target and enemies surrounding the target. The damage Mana Void can potentially deal scales extremely well into the late game, as enemies' mana pools only grow larger over time. His naturally fast basic attacks combined with his powerful abilities make him extremely dangerous in the late game, allowing him to devastate enemies with ease if he is allowed to farm as a hard carry.\n",
        "name": "Anti-Mage"
    },
    {
        "description": "Zet, the Arc Warden, is a ranged agility hero that requires micromanagement and farm to spiral out of control. In the early stages of the game, it is a very powerful nuker. Its first ability, Flux, allows Arc Warden to cripple an enemy down and deal large amounts of damage. It and other allied heroes or buildings can be protected from physical attacks with its second ability Magnetic Field, while gaining swift attack speed. Similar to Techies' Proximity Mines, Arc Warden's third ability, Spark Wraith, allows it to place wraiths that attack when an enemy goes near them, potentially dealing large amounts of magical damage. Finally, thanks to its ultimate, Tempest Double, which allows it to make a perfect copy of itself that can use all of Arc Warden's spells and item abilities, it can spam all of its other abilities and most items twice and easily take down fragile heroes in the early game, or keep itself or its team doubly sustained through certain buffing or healing items. This makes Arc Warden very powerful in both early and late game if given enough farm, from magical nuker to physical carry, or if the time calls it, a very potent support.\n",
        "name": "Arc Warden"
    },
    {
        "description": "Strygwyr, the Bloodseeker, is a melee agility hero imbued with dreadful powers to fuel violence and rip enemies apart in the heat of close combat.\nHe can drive allied targets into a maddened Bloodrage, increasing their attack speed and spell damage at the cost of losing a percentage of their health. He can also cast Bloodrage on himself turning him into a nuker. His speed is unmatched when he senses the blood of the mortally wounded, and from this perception none can escape his Thirst. Passively, he is also able to suck the life of his victims once he has killed them. By using Blood Rite, he can create a ritual field where his foes will be silenced and damaged in the process. His trademark ultimate, Rupture, sunders the skin of his victims, causing them to trail their life force behind if they dare to flee. The ability is persistent just like Bloodseeker himself, totally ignoring magic resistance, and is immune to any kind of Dispel. Almost nothing can save the victim from the wicked wound and the wicked hunter coming for them, except the death itself.\n",
        "name": "Bloodseeker"
    },
    {
        "description": "Gondar, the Bounty Hunter, is a melee agility hero that excels at hunting, chasing down and killing single targets. His skill set allows him to roam and gank very effectively, as his Shadow Walk allows him to sneak up to unsuspecting targets to initiate. Shadow Walk is also an effective escape and mobility spell, as he can run from dangerous situations and roam invisibly around the map to keep the enemy guessing even if they have Observer Wards active. His ability to deal medium amounts of damage with Jinada, interrupt their Town Portal Scrolls with Shuriken Toss, and keep perfect tabs on their location and movements with Track all make him a powerful and ruthless ganker who is all but impossible to escape once he has his sights locked in. Bounty Hunter's ability to roam, scout and get important kills for his team while bolstering their gold gain with Track can secure his team a strong gold advantage, and give his foes no safe place to hide.\n",
        "name": "Bounty Hunter"
    },
    {
        "description": "Black Arachnia, the Broodmother, is a melee agility hero who is a notably powerful pusher. Her trademark spiderlings, as both an asset and a liability, define her play style. While a possible additional source of income, experience and lane pushes, spiderlings can easily feed opponents when not handled with deft micro and great awareness. Broodmother's abilities allow her to summon those spiderlings to do her bidding and to slow and kill heroes with relative ease if caught off guard, all while staying as elusive as possible with her webs and passives. She spends most of the early game pressuring a lane with little concern, due to her spiderlings and her added health regeneration, but she can also transition into a difficult to kill melee carry, which can dive in on and rapidly kill lone enemies with the right items later on.\n",
        "name": "Broodmother"
    },
    {
        "description": "Clinkz, the Bone Fletcher, is a ranged agility hero specializing in ambushing lone enemies due to his high physical damage and incredible speed. Though frail and easy to kill, Skeleton Walk grants Clinkz stealth and haste to escape and re-position himself. This skill is also what makes Clinkz such an incredible ganker. This assassin is also equipped with Death Pact which consumes an enemy unit or creep for bonus health and an armor debuff.  Searing Arrows provide huge bonus damage, greatly injuring enemies. To aid his assault, Clinkz can summon a Burning Army of fiery bone archers who cut down his foes with powerful arrows.\n",
        "name": "Clinkz"
    },
    {
        "description": "Traxex, the Drow Ranger, is a ranged agility hero whose greatest assets are her incredible damage and ability to keep threats at bay. Traxex is a carry who, though lacking survivability, provides a worthwhile contribution through her damage alone. With her incredible physical damage and intense slow, the Drow Ranger can be extremely powerful at any point in the game.\nAs an agility hero, Traxex's damage is based largely on her basic attacks and is among the greatest largely due to the massive amounts of bonus proc damage she gains from her passive ultimate, Marksmanship, which also provides bonus Agility to nearby ranged heroes, while boosting her own Agility at the same time. Despite her lack of escape spells, Drow Ranger can keep herself relatively safe from enemy spellcasters and melee heroes using her Gust, Multishot, and her Frost Arrows, respectively. Frost Arrows infuses her attacks with ice, greatly slowing down her enemies. Since it can be manually cast, Frost Arrows can be used to harass her foes in the early game without drawing the creeps' attention. Gust is a great counter to enemy spellcasters as well as melee heroes as Gust pushes heroes away from Drow and prevents them from casting spells, who might threaten her life in battles. Multishot is excellent to chip away at multiple foes at once from a large distance (while also applying Frost Arrows). Position is of utmost importance as Traxex is quite vulnerable in close combat and the proc damage bonus from Marksmanship is removed when enemies come near her. This means she struggles against melee heroes with high mobility.\n",
        "name": "Drow Ranger"
    },
    {
        "description": "Xin, the Ember Spirit, is a highly mobile and versatile melee agility hero whose abilities make him a slippery foe who can dance around his enemies at will. His skill set allows for aggressive assaults on other heroes, as he can engage on them from long range using Sleight of Fist and tie them down with Searing Chains. His Flame Guard ability deals damage in a small area around him while shielding him from magic nukes, making him a force to be reckoned with by enemy casters. Finally, his Fire Remnant spell enables him to engage, escape, or move instantaneously around the map, allowing him to appear where the enemy least expects and disappear just as quickly.\nDespite a decent health pool early on, he lacks armor and a sizable mana pool, making him frail and easy to kill with physical damage if caught or disabled. However, with good item choices and proper judgment, Ember Spirit can engage his foes using his speed and disables, dominating the battlefield with blinding speed. While he has only a limited presence in the early and mid game, Xin eventually becomes a dangerous opponent even on his own, proving to friend and foe alike that, for them, there is still much to be learned.\n",
        "name": "Ember Spirit"
    },
    {
        "description": "Darkterror, the Faceless Void, is a melee agility hero played as an offlaner or carry. Given a little time, he becomes a terrifying hero capable of destroying entire enemy teams in seconds.\nWielding his cosmically powered mace, each blow can lock his foes in time, stopping them in place. He can jump into or out of combat using Time Walk while simultaneously reverting any damage he has taken in the last few seconds. Darkterror can also pause his foes' cooldowns with Time Dilation, lowering their movement speed in the process. His ultimate, Chronosphere, freezes time for everything within its area of effect, giving him time to pummel any enemies caught within without resistance for several seconds. It's one of the most devastating initiation spells in the game and can win team fights before his opponents can even react.\n",
        "name": "Faceless Void"
    },
    {
        "description": "Aurel, the Gyrocopter, is a ranged agility hero, capable of outputting a lot of single target and area of effect damage at a multitude of ranges. Early game Gyrocopter is a strong ganker, with Rocket Barrage able to output a lot of damage in a short amount of time if he and his target are alone. His second ability, Homing Missile, is a long range projectile that forces opponents to either stop and engage to take out the missile, or run to a safe location before being stunned. Thanks to his third ability, Flak Cannon, he is also an excellent pusher, and with it can farm up big items in the midgame as his spells start to fall off in damage. Flak Cannon also allows him to hit everyone in a teamfight with his attacks, and with enough damage items he can inflict a lot of damage to the entire enemy team. Call Down is a useful ultimate with a low cooldown, providing a large area slow and nuke making it great for team fights. With the right items, he can also transition into a carry role.\n",
        "name": "Gyrocopter"
    },
    {
        "description": "Hoodwink is a tricky ranged agility hero who runs wild through the trees of the Mistwoods. Firing Acorn Shots from her arbalest, she creates new forests through which to Scurry. For her foes, the woods are a dangerous place, full of Bushwhack traps and vantage points for the Sharpshooter to aim the ultimate crossbow shot. This crafty critter should never be underestimated.\nTo those living in the ancient timberlands, the choice came down to following the line of refugees into the pacified zones, falling to Krimwohl's black powder and steel while defending their homes, or fleeing further north to tempt fate in the haunted glens and groves of the misty Wood Tomo'kan.\nSo it was in those treacherous northern mistwoods that Hoodwink came of age, dodging the horrific predators of the Tomo'kan, ingratiating herself with some of the local banditry whilst antagonizing others, and finding absolutely every which way to be underfoot whenever some interesting mischief arose--often allegedly the cause of it.\nBut when the faintest whiff of Krimwohl's fires eventually drifted into her adopted home, Hoodwink's thoughts turned to any family and friends who might have survived the invasion--now made to eke out lives in the razed lands whose wounds scarred her very soul--and she couldn't help but approach the edges of civilization to get a glimpse of the devils that had destroyed her old life.\nThere, she saw that the monsters from her childhood weren't monsters at all. They were just...people. Soldiers, laborers, merchants...and refugees. And the soldiers, even with their black powder and steel, were nothing compared to the dangers of the Tomo'kan--real dangers with tentacles and teeth--dangers she danced around like a twirling maple seed.\n",
        "name": "Hoodwink"
    },
    {
        "description": "Yurnero, the Juggernaut, is a melee agility hero whose abilities allow him to sprint into battle and recklessly devastate enemies in an impenetrable flurry of blades.\nHis abilities grant invulnerability and spell immunity, turning him into an unstoppable force on a hairpin. Juggernaut is strong both offensively and defensively, and deals heavy damage both physical and magical with his Blade Fury and Omnislash ultimate, but he possesses below average strength and intelligence attributes, so he does not have as much health and mana as other heroes and is vulnerable when his abilities are on cooldown. For this reason, although his abilities make him powerful even in the early game, he cannot charge into forces without restraint until farmed and is usually played as a carry.\n",
        "name": "Juggernaut"
    },
    {
        "description": "Sylla, the Lone Druid, is an adaptable and versatile ranged or melee agility hero, who summons a Spirit Bear, which has its own set of abilities and can equip items, as his ally. With the help of his Spirit Bear, he can carry, jungle, and push lanes effectively. Because of this, technically speaking, the Spirit Bear and Lone Druid himself are two available heroes at once. The Lone Druid himself is mostly played as the aura giver, while the Spirit Bear is played as the main damage dealer and tank. When he activates his abilities, it will not only buff him but the Spirit Bear as well. Lone Druid is versatile as he can change from a fast ranged warrior to a tough and mighty melee bear himself. Together, they can push lanes and towers quickly, farm neutrals in a cinch, and even take down Roshan by themselves if equipped with the right items. Due to the Spirit Bear not benefiting from attributes, it scales weakly into the later portions of the game, encouraging a midgame-oriented playstyle. However, should the need arise, its six extra usable item slots make Lone Druid a force to be reckoned with far into the lategame.\n",
        "name": "Lone Druid"
    },
    {
        "description": "Luna, the Moon Rider, is a ranged agility carry hero. Even though she can be seen as a tempting target for enemy heroes, Luna possesses solid early game laning presence due to her Lucent Beams, a cheap, low-cooldown nuke, and her Lunar Blessing aura, which grants all nearby allied heroes an increase in their attack damage. Mid-game, she becomes far more formidable with Moon Glaives, allowing her to kill entire creep waves with two to three attacks, and Eclipse, which can very quickly kill a hero if that hero is unfortunate enough to catch its full blast. Her Achilles' Heel is her fragility; she has no escape abilities and cannot handle a lot of punishment, relying on her movement speed to keep her out of harm's way. Luna begins and ends a match dangerously, and if played carefully and skillfully, she will destroy anybody who stands against her.\n",
        "name": "Luna"
    },
    {
        "description": "Medusa, the Gorgon, is a ranged agility hero. Highly item-dependent, she acts as a carry who can potentially strike down entire teams at once while protected by tank-like survivability. Split Shot allows her attacks to hit multiple targets, greatly increasing the potency of damage-granting items. Mystic Snake grants Medusa some presence in the lane and skirmishes, and its mana stealing refunds part of the cost to boot, making it an excellent farming and harassing tool. Mana Shield protects her from the opening damage of teamfights, and if supplemented with items makes killing Medusa a fatally time-consuming process. Stone Gaze acts as a fantastic defensive mechanism against ganks and initiations alike, with crippling effects on all who dare face the Gorgon.\n",
        "name": "Medusa"
    },
    {
        "description": "Meepo, the Geomancer, is a melee agility hero who is notorious for being one of the most difficult carries in the game to play effectively due to his heavy reliance on micromanagement. Meepo's defining ultimate, Divided We Stand, allows Meepo to create up to 3 additional clones of himself, (4 with the level 25 talent), each of which has its own mana and hit points, as well as individual cooldowns on Meepo's spells. The clones cannot use any items besides the boots that the main Meepo himself wears, but each clone can gain experience and gold additively with the original Meepo, allowing him to gain levels and gold extremely fast. This means that a well-played Meepo can gain experience faster than any other hero, capable of reaching maximum level extremely early into the game and overpowering his unsuspecting opponents; however, Meepo's greatest strength is also his greatest weakness, as the death of any Meepo, including the clones, spells death for all Meepos.\nIndividually, each Meepo is very weak, but by combining their strength and spells Meepo can overwhelm opponents with their nukes and disables. A single cast of Earthbind is little more than an inconvenience, but multiple Earthbinds chained together can allow a Meepo army to keep an enemy permanently rooted to the ground. Poof is a short-ranged area nuke by itself, but combined with the clones allows any Meepo to globally teleport to any other Meepo, and deal increasing amounts of damage when stacked together on the same target. Ransack steals a little HP with each attack itself, but combining the efforts of all clones, it can heal Meepo and all of the clones and deal heavy pure damage to a foe. With this skill set, Meepo can be everywhere on the map at once, and can group up on an unsuspecting victim in a moment's notice. Meepo redefines the power of numbers, and managed properly can overwhelm the enemy as a one-man army.\n",
        "name": "Meepo"
    },
    {
        "description": "Mirana, the Princess of the Moon, is a ranged agility hero that uses her abilities to surprise, chase, and assault enemies. She is an excellent huntress and widely known for her Sacred Arrow which stuns her victim with deadly precision. The arrow stuns longer when it's fired from a farther distance. Mirana can bring down the stars with Starstorm to damage nearby enemies and an additional star to cast down on her one unfortunate target. Mounting with her trusted tiger Sagan, Mirana can Leap forward over a distance, to escape or chase, and enhance her with a roar, increasing her attack and movement speed. Invoking the power of her moon goddess, Mirana uses her ultimate, Moonlight Shadow to cloak all allied heroes and herself with invisibility. At any time, Mirana and her allies can break out of their hiding with an ambush and fade into the shadows again during the duration of the spell. With an array of mighty and supportive abilities, Mirana is a versatile heroine that can excel early in the game as a mobile ganker. She is not very heavily reliant on luxury items but she can benefit from almost any item that gives her presence in the battlefield.\n",
        "name": "Mirana"
    },
    {
        "description": "Sun Wukong, the Monkey King, is a melee agility hero, best known for his slippery nature and his ability to do Mischief, deceiving his enemies by turning into trees and other objects. Armed with his magic extending staff, the Monkey King slams the ground with Boundless Strikes, and leaps to the treetops to have advantage over his foes with Tree Dance. Perched on a tree, he gains a clear view of his surroundings, allowing him to jump down on unsuspecting targets, dealing heavy damage and slowing their escape with Primal Spring. As a carry, the Monkey King is granted extra damage and lifesteal from Jingu Mastery after landing consecutive attacks on his opponents. In a teamfight, at Wukong's Command an army of clones is sent out across the battlefield to fight for him, while he himself has his armor increased. Together with the help of his clones and his team, the Monkey King is a force to be reckoned with.\n",
        "name": "Monkey King"
    },
    {
        "description": "Morphling is a ranged agility hero that has many flexible abilities, item builds and is leveled as a very strong hard carry. He relies strongly on his attributes, and is an effective ganker. Unlike other agility carries that rely on physical attacks, he relies on his powerful abilities to initiate and shift into a state from which he can make a kill. Waveform lets him surge directly forward to a location, damaging enemies on his path, working both as a nuke or an escape. Adaptive Strike is a scaling two-part ability that blasts enemies with a jet of water, either stunning and knocking back or dealing damage. Its power is based on either agility or strength. Attribute Shift allows him to edit his physical being, switching it from Agility or Strength, transforming him into a strong damage dealer or a tank. His ultimate, Morph, transforms him into a copy of an enemy using their stats and basic abilities.\n",
        "name": "Morphling"
    },
    {
        "description": "Slithice, the Naga Siren, is a melee agility hero who can be played both as a late-game carry and an early/mid-game support. Slithice is an item dependent hero yet with the right style and inventory choices she can overpower many other heroes that deal strong physical damage while casting her active abilities to handle her enemies altogether and turn the tides. Mirror Image creates three illusions to wreak havoc upon her enemies. Ensnare is a very useful spell with several unique features. It not only holds an enemy in place, but also prevents them from blinking and going invisible. Rip Tide calls the forces of the seas, allowing the Siren and her illusions to unleash a wave of magical water to wash away foes and degrade their armor. The Song of the Siren is the ultimate ability for team battles; Naga Siren performs a mystical song to put her enemies to sleep in an area around her. Song of the Siren is her tool for initiation, as while her enemies are under her slumber her allies can come forth and prepare to unleash their attacks after the song wears off. Time is Naga's best friend, for as the game wears on, Slithice will gradually consume more and more of the map and engulf enemy towers and heroes like the rising tide itself.\n",
        "name": "Naga Siren"
    },
    {
        "description": "Nyx Assassin, is a melee agility hero who is feared as one of the most effective gankers and solo-killers in the game. With his powerful burst damage nukes, Nyx Assassin specializes in disabling and killing lone and fragile enemies with little to no warning. He possesses an area nuke and stun ability in Impale, allowing him to disable enemies in a straight line in front of him while dealing damage. His Mana Burn ability can destroy a significant fraction of a target hero's mana pool while dealing the same amount as damage, making him the bane of weak intelligence heroes with lots of mana but very little health. Should the enemy attempt to attack him, Nyx Assassin can dissuade them with Spiked Carapace, stunning any heroes that attack him while reflecting their damage back at them. His ultimate, Vendetta, turns Nyx invisible, allowing him to deal tremendous pure damage to the next target that he strikes out of invisibility. Stalking from the shadows, Nyx Assassin can strike without warning and lay low his foes before they realize that their death is upon them.\n",
        "name": "Nyx Assassin"
    },
    {
        "description": "Donté Panlin, the Pangolier, is a melee agility hero. Due to his aggressive and brawling-oriented nature, he is best played in a position where he can quickly get an item advantage over the enemy. Perhaps his most iconic skill is the vector-targeted Swashbuckle, a trickster's tool for swordplay and mobility. Other tools in his kit include Shield Crash, which deals an area nuke and provides him with incoming damage reduction for each enemy hero hit, Lucky Shot, giving his attacks a chance to disarm, and Rolling Thunder, during which he curls into an unstoppable rolling ball which stuns and knocks back anything it hits, at the cost of a decreased turn rate.\nPangolier does not need to be facing towards a unit in order to move, attack, use abilities, or items.\n",
        "name": "Pangolier"
    },
    {
        "description": "Mortred, the Phantom Assassin, is a melee agility hero fitting the role of hard carry. Mortred is best-known, and infamous for, her ability to inflict staggering damage with single strikes. Her abilities synergize supremely well with each other, rendering her an extremely formidable foe once she has acquired the items she requires. She is a very farm-dependent melee Hero, but she farms creeps with much more ease than many of her fellow carries, using her Stifling Dagger for last hitting. Besides eliminating the weakness most melee Heroes have in their farming, her second ability, Phantom Strike, acts as both her escape and initiate, while Blur gives her an edge against other Heroes that depend on their physical attacks by evading them; giving her partial damage immunity to many carries. Her ultimate, the strongest critical strike in the game, is what connects Mortred with four-digit damage and what gives her a place amongst the very best support killers in the late game, since they usually fall instantly from the divine strike her ultimate provides. Mobile and able to fight back nearly every enemy that dares to face her, Mortred is a formidable foe that should never be underestimated, and with appropriate item choices and a few kills, she can snowball out of control and become next to impossible to stop.\n",
        "name": "Phantom Assassin"
    },
    {
        "description": "Azwraith, the Phantom Lancer, is a melee agility hero who can fill the role of carry and pusher because of his ability to generate an army of illusions in a matter of seconds. He requires deep cunning, positioning, and most importantly, great micromanagement as his illusions might just get in the way rather than help the situation if not utilized correctly. Many of his abilities help him in his creation of images, allowing him to always have a companion. He has a nuke ability in Spirit Lance, which deals moderate damage, slows the target, and creates an illusion at his target's location. His escape ability Doppelganger allows him to quickly relocate himself and any nearby illusions while creating additional ones, possibly tricking enemies into wasting their spells and time in trying to kill said illusions. His toggle Phantom Rush allows him and his illusions to close the distance toward a target when issued an attack order, giving him the ability to quickly focus single targets in battle. His ultimate Juxtapose gives him the ability to generate a large number of illusions when attacking a target, while giving said illusions the ability to replicate themselves as well. Phantom Lancer is an extremely mobile hero who is hard to pin down and can quickly overwhelm his opponents in battle.\n",
        "name": "Phantom Lancer"
    },
    {
        "description": "Razor, the Lightning Revenant, is a ranged agility hero who works as a position-based tank/carry that employs his abilities to deal massive damage in a relatively short amount of time, chase down the fleeing injured with his speed, and inflict debuffs on more powerful foes. Razor prefers to keep his position or kite his enemies allowing his spells to unleash its full potential. Known for being a speedy and a great anti-carry hero, Razor specializes in using his opponent's own powers against them, draining them of their damage and using it to smite them, as well as damaging and slowing targets that focus their abilities on him. His ultimate, Eye of the Storm, further enhances his carry-killing powers by inflicting constant, armor-shattering, lightning strikes on the foe with the lowest health within a radius. For those who rely on their pure brute force alone to fight, there is truly no escape from the Underscape.\n",
        "name": "Razor"
    },
    {
        "description": "Riki, the Stealth Assassin, is a melee agility hero that uses stealth in order to surprise enemies and quickly kill them. Usually being played as a carry, his trademark ability, Cloak and Dagger, lets him sneak up on his enemies from behind and deal massive backstab damage, and then quickly escape. This enables him to close in on the enemy and drop his devastating Smoke Screen, which cripples fighters and spellcasters alike. Blink Strike allows Riki to chase with impunity, while Tricks of the Trade makes quick work of his enemies during teamfights. A sneaky and agile assassin, Riki ensures that none of his foes can get away or catch him with each passing opportunity.\n",
        "name": "Riki"
    },
    {
        "description": "Nevermore, the Shadow Fiend, is a ranged agility hero possessing abilities that inflict superb burst damage from varying distances. Whether near or far, Shadow Fiend is able to release incredible offensive power, both physical and magical. Shadow Fiend's true power comes from the souls he takes, making him more dangerous every time he kills. With enough souls, he can release all of the captured souls in a devastating burst, dealing more damage to enemies that are closer to him. Shadow Fiend is a carry who is powerful at all stages of the game, a trait most carries don't share. He can harass and conquer the early game, gank unsuspecting heroes during the mid-stages of the game, and has huge right-click potential in the late game thanks to his passives, although his active abilities scale off by the end-game.\n",
        "name": "Shadow Fiend"
    },
    {
        "description": "Slark, the Nightcrawler, is a melee agility hero that utilizes his abilities to spring onto enemy heroes and slip out unhindered. He is a very mobile ganker, but remains attribute-wise below most other carries unless he is able to steal away attributes with his abilities. Once he does, though, only a few heroes can hope to be as fearsome as the Nightcrawler - extremely mobile to the point of ever-presence, his strikes only hitting harder and faster.\nSlark can quickly leap forward onto enemies with Pounce to leash them and bind them from escaping. His Dark Pact releases a delayed dispel that breaks even the most powerful disables. This gives him one of the most flexible abilities to start and end fights in the game. He is also capable of stealing attributes by attacking his victim to boost his own attack damage temporarily with Essence Shift, which can rapidly shift engagements in his favor, even when merely performing hit-and-run maneuvers. Slark's ultimate, Shadow Dance, allows him to remain unseen even while attacking for a short duration and allows him to move quicker when not under the watch of enemy eyes to strike in and out of enemy ranks unhindered.\n",
        "name": "Slark"
    },
    {
        "description": "Kardel Sharpeye, the Sniper, is a ranged agility hero who excels at dealing moderate to heavy damage from an incredible range. With no escape mechanism, poor mobility, and a low health pool, Sniper is exceptionally frail at all stages of the game and vulnerable to enemies who confront him head-on. However, his abilities provide him both the means to keep his distance and systematically destroy his enemies from afar. Shrapnel is a potent, high-cast range zoning ability that provides vision for Sniper while slowing and damaging enemies in its area of effect; with up to 3 charges on the ability, Sniper can completely close off any viable routes for his opponents to approach or escape. Headshot supplements Sniper's right-click damage and briefly pushes the enemy away, which can be quite crippling for approaching enemies since it has a high rate of occurring. His third ability, Take Aim, gives him the largest attack range of any hero in the game, allowing him to deal high DPS from a safe distance while also giving him the ability to never miss and proc more Headshots, ensuring the enemy cannot contest him from afar. Finally, Assassinate is a strong finishing and harassing ability, dealing hefty damage to an enemy from an enormous distance after a brief aiming period. Sniper is heavily item-dependent, relying on means to increase his survivability as well as his damage output as the game progresses. Skilled players will find that positioning is the most important thing to keep in mind when playing both as him or against him.\n",
        "name": "Sniper"
    },
    {
        "description": "Mercurial, the Spectre, is a melee agility hero, adept at dealing pure damage to lone targets, and is powerful both offensively and defensively. Spectral Dagger provides a significant amount of mobility, allowing Spectre to go through objects, units and terrain while slowing foes that come in contact with the shadowy path left by her Spectral Dagger. Desolate allows her to inflict high pure damage to enemy heroes when she catches them alone. Dispersion reduces and reflects all damage, whether by attacks or spells, to an area around her. Dispersion gives her great durability, especially when equipped with items that provide health, armor, and damage block. Finally, her Haunt creates a malevolent spectral illusion to all enemy heroes in the map. Haunt lets Spectre wreak havoc in clashes and ganks, while her allies take advantage of the confusion. Spectre can use Reality during the Haunt, instantly teleporting her to her illusion to take its form. This lets her hound her victim anywhere on the map. Mercurial is a dangerous supernatural being, relentless as she can chase and stalk down her victim to a global range, unhindered by boundaries. Her kit allows her to play the role of the team's hard carry by applying an immense amount of pressure in late game team fights. More specifically, the damage reflection from Dispersion makes it disadvantageous for teams to focus her. Her abilities have a complex nature, and newer players should generally not play Spectre as she is extremely farm and level dependent. It is best to face Spectre with allied help and strength, as encountering her alone is not always the best option.\n",
        "name": "Spectre"
    },
    {
        "description": "Lanaya, the Templar Assassin, is a very short-ranged agility hero capable of dealing huge bursts of physical damage to swathes of enemies with expert positioning and timing. Unlike most physical damage dealers, Lanaya reaches her damage potential quite early and then scales up from that point with carry items, letting her gank with impunity throughout the mid-game, and her short attack range increases from being comparable to that of a melee hero to a ranged hero with short reach as she levels Psi Blades.\nHer Psionic Traps provide map control and the ability to chase down fleeing heroes from a distance, and Refraction and Meld lets you shrug off high-damage nukes and disjoint projectiles. With a Blink Dagger, Lanaya can quickly materialize in the enemy team's weakest flank and shred several heroes at once with her Meld and Psi Blades.\n",
        "name": "Templar Assassin"
    },
    {
        "description": "Terrorblade, the Demon Marauder, is a melee agility hero who grows to a devastating carry in the later stages of the game. Terrorblade has the highest starting armor in the game, but is squishy due to his low health, meaning he needs strength items to be tanky enough to sustain damage to himself and his illusions. As with all illusion-based heroes, he needs attribute-based items in order to make his illusions powerful. He uses Reflection, which creates invulnerable illusions of all nearby enemy heroes for a few seconds. Conjure Image creates an illusion of Terrorblade that deals considerable damage at max level. Terrorblade can create up to two illusions, which together deal more damage than Terrorblade himself, effectively multiplying Terrorblade's base damage (but not his bonus damage). Metamorphosis transforms Terrorblade into a powerful ranged demon capable of wreaking havoc on his enemies with its bonus range and damage. Metamorphosis also makes illusions of Terrorblade transform into his demonic form, but they revert back once they wander too far away from Terrorblade. Finally his ultimate, Sunder, swaps his health with a targeted hero, ally or enemy alike. This ability makes ganks on him incredibly risky since he can sunder a hero before finishing them off with a few attacks. With his two illusion-based abilities, the 'semi-ultimate' Metamorphosis and his ultimate, Sunder, Terrorblade's skill set makes him a strong foe in the early game and absolutely terrifying at the later stages of the game. He is usually played as a hard carry.\n",
        "name": "Terrorblade"
    },
    {
        "description": "Jah'rakal, the Troll Warlord, is a ranged agility hero able to output mighty damage competitively at range and in melee. His Berserker's Rage gives him the unique ability to change his attack position from ranged to melee and back at will as the situation warrants. When in close combat, his stats are increased accordingly: he gains bonus armor, movement speed, reduced base attack time, and the ability to root. Not only does this greatly improve the Troll Warlord, but allows him to overpower most other carries, as well as permanently ensnare a target for extended amounts of time. The Troll Warlord is an axe specialist, using them in his unique Whirling Axes, which has two variations: the first is available to his ranged form wherein he throws axes in a cone formation to damage and slow enemies. The second is available to his melee form, whirling axes around himself in a small radius to damage and blind nearby enemies. In keeping with his savage nature, Fervor builds up the Warlord's momentum, granting him attack speed with each consecutive hit on the same target, though the momentum is lost upon switching targets. His Ultimate, Battle Trance, increases his attack speed further, boosts his movement speed, prevents death and grants lifesteal at the expense of almost complete loss of control when enemies are nearby, mindlessly attacking them. Notorious for his superbly fast attack speed that can be matched by few, Jah'rakal is truly a force to be reckoned with.\n",
        "name": "Troll Warlord"
    },
    {
        "description": "Ulfsaar, the Ursa Warrior (or simply Ursa), is a melee agility hero whose abilities' main focus is the increase of attack damage, allowing for some of the most impressive sustained damage in the entire game.\nHe specializes in increasing damage against one target. His abilities allow him to attack with almost maximum speed and gain bonus damage with each consecutive hit on a single target. With the abilities Overpower and Fury Swipes, Ursa can often savage beefy targets for as much as 700 damage per hit. He is a ferocious jungler and straightforward attacker, able to solo even Roshan at low levels if he has lifesteal. Ursa is a carry who can snowball if he is farmed, but the array of anti-melee abilities existing even by the early game and his lack of any counterspells may cripple his potential, especially as strong nukers and heroes with the ability to evade him make him a hero reliant on spellcasters on his team. Although an agility hero, Ursa's base strength and strength gain make him very durable.\n",
        "name": "Ursa"
    },
    {
        "description": "Shendelzare, the Vengeful Spirit, is a ranged agility hero who excels at ganking, disabling, and kill hunts. She is one of the most well-rounded supports in the game, possessing a skill set that allows her to set up kills for her team during ganks and teamfights, strengthening her team and weakening the enemy in large-scale engagements, and saving allies from certain death if they are caught by the enemy.\nEffective at all stages of the game, Vengeful Spirit is typically seen roaming the battlefield, searching for targets to prey on. She possesses a strong targeted stun in Magic Missile and an armor reduction debuff in Wave of Terror, making her a strong partner in a gank. Motivated by her lust for revenge, Vengeance Aura boosts the damage of all nearby allies, making Vengeful Spirit an invaluable ally to teams with strong physical damage output and turning her into a potential semi-carry. Her ultimate Nether Swap immediately swaps Vengeful Spirit's position with another hero, ally or enemy, allowing her to displace a key enemy hero for easy elimination, or save an ally in distress at the potential cost of her own life. Vengeful Spirit's skill set and low reliance on farm allows her to be played with great recklessness, as even her death can be integral towards guiding her team to victory. Vengeful Spirit requires very selfless and skilled play to operate well, and relies on the competence of teammates as much as herself.\n",
        "name": "Vengeful Spirit"
    },
    {
        "description": "Lesale Deathbringer, the Venomancer, is a ranged agility hero who is focused on dealing damage over time and slowing enemies down. While unassuming due to his mediocre stats and low attack range, he can inflict surprising amounts of gradual damage with his poisonous abilities if left alone. Venomancer can unleash a Venomous Gale to infect enemies in a straight line, drastically slowing them while dealing damage over time. His attacks are just as hazardous thanks to his lethal Poison Sting, which adds a toxic effect to his normal attacks, poisoning opposing Heroes for a great amount of damage over time. Plague Ward lets him summon a sentient ward to a targeted point, which attacks enemies or structures. While weak on first use its power grows in numbers, which means the more the wards are placed the deadlier they become. This gives him good versatility, providing vision, pushing power, and a helpful block, preventing enemies from running away when trapped in a sticky situation. Venomancer's most dangerous ability is Poison Nova: though it is not lethal and does not kill an enemy by itself, the damage it inflicts is tremendous, the duration is very long, and its wide area of effect makes it difficult to avoid. It is mostly used to initiate battles, since Poison Nova cannot quickly inflict damage but rather degrades its targets over time. When combined together, the Venomancer is a powerful killing machine, like a virus, slowly killing enemies with venom and poisons. Despite being considered by most players as a support, because of his slowing capabilities, extra ward vision, and being item independent, this does not hinder his power to gank and kill enemies, especially in the earliest parts of the game, and with enough kills, farm, and domination, Venomancer can transition into a semi-carry, with formidable venomous power and deadly specialties.\n",
        "name": "Venomancer"
    },
    {
        "description": "Viper, the Netherdrake, is a ranged agility hero who functions as an excellent nuker, ganker and carry due to his assortment of low-cooldown spells and debilitating attacks. His modus operandi is to whittle away his opponents' vitality over long stretches of time while they fail to inflict fatal damage. To that end Viper wields magic-based abilities focused on inhibiting speed and defenses. He infects his quarry with Poison Attack, a seemingly innocuous liquid that rapidly burns away more health as they became sicker, while drowning them in noxious pools which block their innate powers. Meanwhile Corrosive Skin fortifies him against magic damage and poisons those who dare strike him. For impervious foes he reserves his most powerful venom, Viper Strike, as a surprise gift. A slow tank that dominates the early stages of a game, Viper depends on consolidating that advantage before opponents can afford to exploit his weaknesses.  \n",
        "name": "Viper"
    },
    {
        "description": "Skitskurr, the Weaver, is a ranged agility hero, renowned for being one of the hardest heroes in the game to properly lock down and kill, despite his extreme fragility. This is mainly due to his low-cooldown Shukuchi ability, which provides him both max movement speed and invisibility when used, making him highly effective at chasing enemies as well as escaping from battle. Additionally, his ultimate, Time Lapse, is another survival tool, allowing Weaver to regain the position and health points he had precisely 5 seconds prior to activation. His exceptional ability to maneuver around the battle, seeking the most fragile enemy heroes, is bolstered by his last two abilities. The Swarm is a wave of insects projected in front of Weaver that latch onto any visible enemy they come across. Until they are killed off, they will gradually inflict damage over time, reduce enemy armor, and perhaps most importantly, provide vision to Weaver. Finally, Geminate Attack allows Weaver to passively launch an additional attack every few seconds, making his offensive all the more potent. Not a hero capable of standing on the front lines, Weaver is nonetheless a huge threat against a team that has little ability to prevent his extreme maneuverability.\n",
        "name": "Weaver"
    },
    {
        "description": "Kaldr, the Ancient Apparition, is a ranged intelligence hero who is usually played as a support. Though frail, this icy elemental caster possesses strong semi-spammable spells and a painful global ultimate. Cold Feet harms enemies and will also stun them unless they move away from the cast area, making the spell dangerous when used in conjunction with disables from allies. Ice Vortex is a low-cooldown zoning ability, applying a heavy slow and magic damage amplification to nearby enemies. This combines effectively with Chilling Touch, which endows Kaldr with enhanced magic damage from great range. His ultimate Ice Blast is one of the game's most devastating spells, with a global range and a radius that increases the further the blast travels. All enemies struck by it endure hefty damage, are temporarily prevented from healing or regenerating, and instantly perish if their health falls too low. Ancient Apparition can be devastating in team fights, and makes an excellent counter to heroes who rely on healing and regeneration.\n",
        "name": "Ancient Apparition"
    },
    {
        "description": "Atropos, the Bane Elemental (or simply Bane), is a ranged intelligence hero whose dark and nightmarish abilities give him prowess as a disabler, ganker, and nuker. Mostly played as a support, his high starting stats make him a menace in lane. Bane possesses four potent single-target spells, which must be used well to make up for his lack of pushing power or area of effect presence. Bane's first spell, Enfeeble, reduces the target's attack damage, health regeneration, and the speed they cast spells, crippling physical damage dealers, tanky brawlers, and spellcasters alike. Brain Sap deals hefty damage to the target and heals Atropos for the same amount, giving Bane a massive presence in small skirmishes. Nightmare puts a unit to sleep, completely disabling it for several seconds. The unit awakes when it is attacked or takes damage, though Bane can freely attack nightmared targets without waking them. Finally, Bane's Fiend's Grip is a channeled spell that completely disables the target, drains its mana and deals high damage over time. Bane's aptitude for incapacitating and debilitating enemies make him an invaluable support to allies—and a nightmare for enemies.\n",
        "name": "Bane"
    },
    {
        "description": "Batrider is a ranged intelligence hero who excels at initiation and harassing enemies. He is a mobile raider capable of dealing enormous amounts of damage, though he must close in on targets to pull it off. Batrider begins by spraying areas with Sticky Napalm, a stacking debuff useful for hindering enemies or gaining vision. In order to get a better view he activates Firefly, leaving a burning trail of liquid fire that scorches those who dare cross his path. Now able to cross through previously impassable terrain Batrider has free reign to decide how to continue his reign of terror. If he's feeling generous he'll hurl an explosive clocktail as a parting shot. More often, he seizes victims with Flaming Lasso and drags them back through his burning trail to the clutches of merciless allies. Used properly, Batrider is a fearsome hero constantly risking his own safety to incite fiery chaos and destruction.\n",
        "name": "Batrider"
    },
    {
        "description": "Chen, the Holy Knight, is a ranged intelligence hero, whose signature ability, Holy Persuasion, allows him to take control of creeps. Commanding them well requires adept micromanagement and map awareness, but once mastered Chen becomes an effective ganker and one of the game's strongest early pushers. His ability to convert creeps makes it natural for him to spend the laning phase as a jungler, emerging to pick off enemies with his creep army's array of disables. Chen's ultimate Hand of God heals all his creeps and allied heroes wherever they are on the map, allowing him to sustain pushes and secure objectives. And that he must, building up a strong lead before his creeps lose their threat in the late game.\n",
        "name": "Chen"
    },
    {
        "description": "Rylai, the Crystal Maiden, is a ranged intelligence hero who uses the power of frost and ice to disable and dispatch her foes. A slow and fragile support, Crystal Maiden's strength lies in her battery of strong nukes, disables and slows. Crystal Nova is an area-of-effect nuke that slows enemies' attack and movement speeds, while Frostbite immobilizes an enemy in a block of ice, dealing moderate damage per second. Coordinating these spells with a laning partner's own abilities will bring many an enemy to their knees. Her passive Arcane Aura also improves the mana regeneration for heroes in Rylai's team, multiplying their spellcasting in the early game. Later on, she has the potential to lay waste to her enemies in teamfights if she can channel her deadly ultimate Freezing Field uninterrupted. Her global mana aura, strong disables and nukes, and a lack of item dependence make Crystal Maiden a reliable and, with judicious use of her ultimate, a devastating support caster.\n",
        "name": "Crystal Maiden"
    },
    {
        "description": "Ish'kafel, the Dark Seer, is a melee intelligence hero who relies on his abilities' potent utility and synergy. In lane he is sustained by high armor and enabled by his Ion Shell and Surge. Surge boosts his or an ally's speed, helping them to escape or pursue opponents. Ion Shell wraps a unit in a spiky shield that rapidly damages nearby enemies, enabling Ish'kafel to harass and gain last hits. These abilities also make him an efficient jungler and therefore a natural semi-carry, usually focused on building utility items. \nDark Seer's greatest damage is done during teamfights and comes from the combination of his final two abilities. Vacuum makes for powerful initiations. It sucks in nearby enemies, briefly disabling them and making them susceptible to area of effect spells—such as his Wall of Replica. The wall slows his foes and creates replicas of any enemy heroes that cross it, high-damage illusions that Dark Seer can control. A subtle hero, Ish'kafel's dark energies can be deadly in the right hands. \n",
        "name": "Dark Seer"
    },
    {
        "description": "Mireska Sunbreeze, the Dark Willow, is a ranged intelligence hero with a powerful array of disables and nukes. She can summon a tangle of thorns to root enemies in her Bramble Maze, or curse an enemy to stun them after a delay with Cursed Crown. Slipping into the Shadow Realm to avoid attacks, she re-emerges with a powerful magical burst. Calling upon her companion Jex, Dark Willow dishes out a flurry of heavy magic damage with Bedlam, or sends her enemies fleeing in fear with Terrorize. This wide arsenal of disables and nukes allows her to gank, roam, and support with equal efficiency, making her indispensable in teamfights.\n",
        "name": "Dark Willow"
    },
    {
        "description": "Dazzle, the Shadow Priest, is a ranged intelligence hero who conjures dazzling dark light to heal his allies and prevent their deaths. His Shadow Wave is a low-cooldown nuke and chain healing ability, dealing more damage to nearby enemies for each ally the wave heals. Shallow Grave makes an ally temporarily unkillable, allowing Dazzle's teammates to survive impossible situations. Poison Touch is a spammable ability that slows its target and deals damage over time. His ultimate, Bad Juju, allows for all of his spells and items to be used more frequently, while also causing his spells to temporarily reduce his enemies' armor.\nA hard support with little item dependence, Dazzle's Shadow Wave nevertheless gives him the option to farm or push waves when he needs to. He also scales well into the late game, as unlike most supports his spells deal physical damage, and all of them but Poison Touch pierces spell immunity. Loyal priest of the shining shadows, Dazzle will save you time and time again.\n",
        "name": "Dazzle"
    },
    {
        "description": "Krobelus, the Death Prophet, is a ranged intelligence hero who excels at pushing lanes. She is often played in the mid lane, since her Crypt Swarm gives her strong magic damage that can be spammed to her heart's content. As she levels her ultimate, Exorcism, Death Prophet can deal a huge amount of damage to towers and heroes alike, while healing at the end of the duration. If Exorcism's own heal isn't enough, she still has Spirit Siphon which drains health based on the target's health and can even be used on multiple targets at the same time. Finally, her Silence gives her a powerful tool to disable enemy casters and heroes that rely on escape abilities. Because she can deal large amounts of damage over time with her ultimate and Crypt Swarm, Death Prophet is mostly built as a tank, to ensure she can continue to stay in the fight.\n",
        "name": "Death Prophet"
    },
    {
        "description": "Disruptor, the Stormcrafter, is a ranged intelligence hero who requires good positioning to use his abilities effectively. His signature ability is Kinetic Field, a pseudo-disable that traps enemies within a small area for a long duration. Combined with his Static Storm, Disruptor can act as the initiator for a teamfight, or supplement his teammates' initiation very well. Glimpse is another powerful spell that forces enemies to watch their movements, as Disruptor can easily drag them back to a previous location to be focused down. Thunder Strike provides Disruptor with some reliable single-target damage, but more importantly grants vision on the target to prevent jukes and escapes.\n",
        "name": "Disruptor"
    },
    {
        "description": "Aiushtha, the Enchantress, is a ranged intelligence hero who uses her abilities to push through lanes and gank with relative ease. Enchantress works well as a jungler in the early game, as it maximizes the effectiveness of her Enchant ability or, harass enemies in lane using Impetus that deals damage based on how far her target is. On first glance, she may be just a support, serving her allies with powerful heals, creep abilities and slows, but as time goes on, her power increases and once she is packed with good items, Enchantress' regular attacks are strong enough to kill most heroes with a couple of attacks if they stand far enough, while avoiding burst attacks with the help of Untouchable. This will make her a potential carry.\n",
        "name": "Enchantress"
    },
    {
        "description": "Enigma is a ranged intelligence hero who uses his abilities to cripple his enemies, supported by a seemingly inexhaustible army of creeps. His fearsome abilities can bind entire teams under his might. Enigma is also a formidable jungler and pusher owing to his ability to create creeps.\nThe deliverance of his ultimate, Black Hole, engulfs an area around him with dark energies and disables enemies caught within it, making him an extremely powerful yet conditional initiator and disabler. His Midnight Pulse consumes sections of enemies' life in a region over time and his Malefice stuns targets. His trademark ability is Demonic Conversion, which splits a creep into three eidolons under his control. If they can land enough attacks on an enemy unit before their expiration, they multiply and are healed to full health.\n",
        "name": "Enigma"
    },
    {
        "description": "Grimstroke is a ranged intelligence hero specializing as a nuker and offensive support. With an arsenal of punitive and disabling spells, he forces enemies to rethink their actions, or retreat from his overbearing attacks. His long cast range also allows him to harass and zone out opponents while delivering substantial damage from the back line.\nStroke of Fate is a simple, linear nuke that slows enemies in its path, setting them up for follow-up abilities. Phantom's Embrace forces targets to stop and attack the phantom, or suffer heavy damage. Enemies are discouraged from approaching or attacking allies shielded with Ink Swell, as doing so could result in extra damage and a long, area-of-effect stun. Combined, Grimstoke's abilities dish out heavy magical damage, with the potential to quickly decimate two enemy heroes chained together under his ultimate, Soulbind. The capacity to slow, stun, silence, and bind multiple targets makes Grimstroke an extremely potent figure who should never be underestimated in teamfights.\nThe people of Ashkavor crowded around the temple square, eager to witness the ascension of their new guardian -- to stand near the man as he bound their souls to his own. But as his final brush strikes fell against the runestone, and the bond of a new Ascended One was forged, everyone -- even those who'd stayed in their homes -- could sense that something had gone terribly wrong.\nHe knew the cause instantly. The droplets of ichor he'd procured to amplify the potency of his inkpots had instead contaminated them, and the power of the binding spell he'd cast now threatened to consume him. An inky corruption snaked upward from the runestone, along the handle of his brush, soon overtaking his hands. From there it spread quickly. Once it overcame his face and his mouth, he couldn't have screamed even if he'd wanted to.\nAll of his life he'd calculated on how to attain ever greater powers than the limits presented by his teachers would allow--going on far as to break the sacred prohibition against augmenting the inks. Indeed, with the wellspring of the Ascended bond open to him, he felt a measure of power coursing into his soul like he'd never imagined. His greatest triumph was upon him, if he could only survive it.\nHe drew deep from the power of the bond, pushing back against the corrupted ink flow. A great moan filled the air -- the collective cry of his people. Some swayed on their feet. The weakest collapsed. Many tried to run. And still deeper he pulled from their bloodline reservoir. But it wasn't enough to stop the ink tide.\nIt was only when the breath trapped in his lungs began to fail him, and the inkpool darkness fully encased him, that he saw his way out. The bond he'd made with the Ashkavoran people -- his people -- meant to be drawn upon only in service of their protection... it flowed two ways.\nWith the final surge of strength -- this time directed by more than just blind repulsion -- he pushed the ink torrent into the bond itself.\n",
        "name": "Grimstroke"
    },
    {
        "description": "Carl, the Invoker, is a ranged intelligence hero who is very difficult to master. He is unique in that he possesses a total of 14 abilities in his arsenal; three of them - Quas, Wex, and Exort - are reagents and one is his special ultimate Invoke. The three abilities he learns throughout leveling up can have three instances, which serve as the basic ingredients or components for him to create a new ability using his ultimate. Once the reagents or elements are combined, he can invoke one out of ten different abilities. All of his invoked abilities are capable of a multitude of actions, from damaging enemies to aiding his allies, and even saving himself from danger. His three reagents can be upgraded up to level 7 which determines the power and potency of his invoked abilities, making it more powerful than an ordinary spell. Because of this, he can be played in almost any role possible. Invoker can be a carry, semi-carry, ganker, pusher, initiator or even support. His three reagents provide a passive bonus per instance, allowing for specialization at early levels and situational boosts at later levels. His extremely flexible nature allows him to use many different combinations of items effectively but also make him dependent on solid builds and a good gold advantage.\nInvoker is available in Ability Draft, but due to his very unique nature, he has been heavily modified to work in that mode. See Invoker in Ability Draft for details.\n",
        "name": "Invoker"
    },
    {
        "description": "Jakiro, the Twin Head Dragon, is a ranged intelligence hero who utilizes the powers of ice and fire with powerful linear area spells. He can freeze enemies in place with Ice Path, or slow them down with Dual Breath. He is capable of dealing heavy damage throughout the game by locking enemies inside his Macropyre, and provides great pushing power with Liquid Fire.\nWith high base attribute gain and relatively low mana costs, he requires few items to be effective. Jakiro is a support who can continually turn battles in his favor with good positioning. His high strength gain makes him a bit tougher than most spellcasters and his low cooldowns ensure that his downtime is very minuscule, making him a great hero for ganks, pushes and clashes across the battlefield.\n",
        "name": "Jakiro"
    },
    {
        "description": "Ezalor, the Keeper of the Light, is a ranged intelligence hero famous for his reputation as a one-man support team. Supporting his allies in need, and pushing unguarded lanes with ease, Ezalor is a very valuable ally for any team. Having a variety of useful abilities, he can channel a powerful globe of intense light that can heavily damage an army of enemy creeps in the lane, allowing for an easy push. He can also restore mana and reduce cooldown for himself and his allies as well as blind his enemies with an intense light that also damages and displaces them. His Ultimate hypnotizes enemies in an AoE periodically, allowing his allies to follow over with their attacks around this immensely powerful crowd control. Keeper of the Light requires patience, confidence, and selfless behavior to play him well, as he is played as a support instead of a killer caster like most Intelligence gankers. His set of abilities also requires good timing, reflexes, and knowledge to use well.\n",
        "name": "Keeper of the Light"
    },
    {
        "description": "Leshrac, the Tormented Soul, is a ranged intelligence hero who is known for his ability to put out a tremendous amount of area magical damage. His array of spells makes him a dangerous foe to stand around, as he can disable and nuke down anyone who dares to stand against him. Split Earth is an area stun that, after a delay, will stun all enemies in its radius while dealing damage. Diabolic Edict is a damage-over-time spell that deals physical damage, corroding all enemies near Leshrac. Unlike most other spells, it can also affect buildings, making Leshrac a very powerful tower killer who can push very effectively. Lightning Storm is a targeted nuke that damages and slows enemies as it jumps from foe to foe, easily clearing away creeps. His ultimate, Pulse Nova, deals magical damage in an area around Leshrac while it is active, making short work of nearby enemies. Few can withstand Leshrac's damage output, as all of his spells combined allow him to scour his foes from the battlefield.\n",
        "name": "Leshrac"
    },
    {
        "description": "Ethreain, the Lich, is a ranged intelligence hero that uses his abilities to slow his enemies down with his ice-based attacks, as well as giving a boost to ally defenses, and serves as a great teamfight ganker with his powerful ultimate. His Frost Shield bolsters his team's defenses with a damage-absorbing shield while releasing slowing pulses of ice to either deter enemies or catch up to them in a chase. Lone enemies he can disable and pull closer to himself with his Sinister Gaze, potentially pulling the target to their own demise. But his foes will find no safety in strength in numbers, as Lich's ultimate, Chain Frost deals massive damage to enemy heroes who dare stick together. While a relatively frail hero and mostly known as a support, Lich is a powerful crowd controller and can easily turn any teamfight or dominate in a lane.\n",
        "name": "Lich"
    },
    {
        "description": "Lina, the Slayer, is a ranged intelligence hero, adept at destroying enemy heroes quickly by delivering massive bursts of magical damage, making her one of the most effective gankers in the game. She possesses immense damaging capabilities all throughout the game, but is very fragile. Two of her fiery spells are her main source of damage, Dragon Slave sends a wave of fire to burn enemies in her path while Light Strike Array stuns them with a concentrated pillar of solar flame. Each of her spells deals great damage early on and has a low cooldown. Her Fiery Soul bolsters her attack and movement speed every time she casts a spell, which gives her scaling damage for the later game. Laguna Blade, her ultimate, is her ace in the hole. Lina fires off a huge bolt of lightning at a single target, dealing colossal damage. Laguna Blade's damage is staggering in early-mid game, and late game is still enough to destroy frail enemy heroes. Dragon Slave, Light Strike Array, and Laguna Blade are incredible flaming nukes that can incinerate her target instantly, and Fiery Soul allows her to transition into a strong and fast physical attacker. Though her power falls from its peak late game, mana-boosting and damage-increasing items can be purchased to keep herself up.\n",
        "name": "Lina"
    },
    {
        "description": "Lion, the Demon Witch, is a ranged intelligence hero, most commonly played as a support, who serves as a powerful offensive spellcaster. While exceptionally frail and vulnerable at all stages of the game due to his low health pool, armor, and movement speed, he has a tremendous amount of disabling and nuking power, allowing him to provide the necessary lockdown and burst damage to his team to bring down elusive and shifty enemies. Earth Spike is an area-of-effect line-based stun that also deals a moderate amount of damage. If Lion uses it at max level combined with his Hex, which briefly transfigures an enemy into a harmless critter, he can disable a single opponent for almost 7 seconds, more than enough time to bring down a lone enemy, especially if an ally is present. His ultimate, Finger of Death, serves as a powerful nuke and his primary source of burst damage to aid him in his endeavors. To offset the high mana cost of his abilities, he has Mana Drain, which provides him the sustenance he needs to continuously provide his disabling prowess in a skirmish. A team facing a Lion would do well to eliminate him first in a fight, lest it fall prey to his potent and disruptive spells.\n",
        "name": "Lion"
    },
    {
        "description": "Nature's Prophet is a ranged intelligence hero, whose play style is different from most intelligence heroes, because he can be almost anywhere at any given time with his Teleportation. This ability allows him to participate in most ganks and pushes at a moment's notice. With Sprout, he creates a ring of trees, trapping anyone within them in place, serving to disable anyone caught within them. The trees around him serve as his objects of power; using them, he summons sentient tree beings known as Treants from trees on the map with his Nature's Call ability. Wrath of Nature is the main and only directly damaging spell in his arsenal, but it can potentially be very powerful, as it can inflict increased damage with each bounce off subsequent enemies and can clear out multiple creep waves with its moderate cooldown and mana cost. Commonly played as a ganker, offlaner and jungler and known as a strong pusher, Nature's Prophet has superb farming capabilities and global presence, giving him the power to be anywhere on the map. Late-game, Nature's Prophet makes himself useful by constantly distracting and annoying the enemy team by pushing. If attention is not given to him, he can single-handedly win the game by constantly taking several towers or even the Ancient.\n",
        "name": "Nature's Prophet"
    },
    {
        "description": "Rotund'jere, the Necrophos, is a ranged intelligence hero. His abilities are most effective in team fights where he can damage enemies and heal allies simultaneously, while picking off key enemy heroes with his ultimate. Necrophos is most dangerous when his enemy is severely injured, instantly killing them with his ultimate while recovering over time after killing his foe. Necrophos is naturally fragile, but his mechanics require him to stay in the midst of encounters; it is for this reason that he depends on items to prevent his death. Ideally, by casting Death Pulse repeatedly, he and his team are able to stay alive, while regenerating his health and mana for each life he takes, while the enemy team's health is gradually decaying by those same pulses and his Heartstopper Aura, which reduces enemy health by a small percentage each second. Because his abilities are suited to prolonged encounters, he must build items which allow him to survive for as long as possible against his enemies, as well as utilizing his Ghost Shroud to dodge physical damage and crippling the movement of his enemies, allowing his team to catch up and surround them. When the time is right, his ultimate, Reaper's Scythe, has its damage increased by how much of their maximum health the target is missing; meaning that an enemy that is close to death will be killed outright by it. Necrophos is best understood as a hero who is weak at the beginning of a fight but becomes more dangerous with each passing second.\n",
        "name": "Necrophos"
    },
    {
        "description": "Aggron Stonebreak, the Ogre Magi, is a melee intelligence hero, famous for his random potential for extreme burst damage and his enormous health pool for an intelligence hero. He has good base attributes, and some of the best attributes gain in the game, having a very high base strength, as well as the highest strength gain of any intelligence hero by far. Coupled with his high base armor and high health regeneration, Ogre Magi is very hard to take down in the early game. He is a powerful ganker and disabler, slowing his enemies first with an Ignite, then proceeding to eliminate his opponents with Fireblast. Later in the game he takes on the role of a buffer/debuffer with his powerful Bloodlust buff, buffing his carry's damage potential enormously. And if you happen to be skilled enough, his ultimate Multicast gives him the opportunity to randomly cast his spells multiple times, allowing for great burst potential. Ogre Magi is a very strong disabler, requiring nothing but a bit of luck to successfully pull off his powerful Multicasts.\n",
        "name": "Ogre Magi"
    },
    {
        "description": "Nerif, the Oracle, is a ranged intelligence hero who alters the fate of allies and enemies with his combination of multipurpose nukes and buffs. He possesses the ability to change his foes' fortunes with Fortune's End, which deals nuke damage and pins down any enemies in its radius, while dispelling buffs from them. His Fate's Edict can be cast on allies and enemies alike, disarming them but also granting them complete resistance against magical damage; used with skill, he can render his foes' weapons useless or shield his allies from unfriendly spells. Purifying Flames, like Fate's Edict, can be cast on friend or foe, dealing magical damage but also applying a healing buff to them. His signature ability and ultimate, False Promise, puts an ally's fate on hold, removes every dispellable disable and prevents them from being harmed by the enemy for a short time, and then fully returning them to reality at the end of the spell's duration. Knowledge of Oracle's skills is key to use him at his full potential; while he can defy destiny and snatch victory from the jaws of defeat, one mistake can potentially seal the fate of his allies.\n",
        "name": "Oracle"
    },
    {
        "description": "Harbinger, the Outworld Destroyer, is a ranged intelligence hero who qualifies as a carry, though unlike traditional carries, he excels against high-armor targets whilst being crippled by spell immunity. With Arcane Orb, his damage output is reliant on his intelligence attribute and the size of his mana pool, so he must focus more or less exclusively on items which augment them. Though he lacks somewhat in range and has no innate mobility skills, Arcane Orb deals Pure damage, meaning that if he gains an advantage in a match he deals constant, colossal damage which cannot be decreased or resisted except with total spell immunity and gets stronger with each hit. He enjoys more-or-less unlimited mana because of his Essence Flux. With Astral Imprisonment, Harbinger can render himself or an ally invulnerable for a short period of time, or disable the target enemy. His ultimate, Sanity's Eclipse, can instantly deal colossal area-of-effect damage against his enemies based on how much greater his mana pool is than theirs.\n",
        "name": "Outworld Destroyer"
    },
    {
        "description": "Puck, the Faerie Dragon, is a highly mobile ranged intelligence hero best known for being an extremely unpredictable and slippery target. Puck is commonly played as an initiator and ganker, with spells such as Illusory Orb and Waning Rift that are equally useful for super-aggressive maneuvers as well as daring escapes, or using Dream Coil to create havoc and crowd control your enemies. Expert use of Puck's abilities together with items such as Blink Dagger will let you appear out of nowhere, suddenly leave your enemies confused, crippled and disadvantaged, and get away in the blink of an eye – but mess up your timing or misjudge the situation, and there is little left to save this fragile Hero from death.\n",
        "name": "Puck"
    },
    {
        "description": "Pugna is a ranged intelligence hero whose spells give him powerful nuking and pushing capability. Nether Blast is a low-cooldown area nuke with slight delay that deals significant damage to buildings, giving Pugna the option to use it both as a basic nuke as well as a pushing spell. Decrepify is a unit-targeted spell that gives its target the ethereal status effect, rendering them unable to take physical damage but also slowing them and decreasing their magic resistance. Nether Ward drops a stationary, ward-like device that severely debilitates enemy casting, dishing out powerful nukes proportional to how mana-intensive the enemies spells are. Pugna's ultimate ability, Life Drain, is a channeling ability that saps enemy health and grants it directly back to himself. It can be cast on allies to give them health and mana as well. With a strong array of nukes and a spell specifically designed to amplify them, Pugna is a force to be reckoned with both in teamfights and solo situations, able to blast his foes into Oblivion quite easily.\n",
        "name": "Pugna"
    },
    {
        "description": "Akasha, the Queen of Pain, is a ranged intelligence hero who uses her abilities to close in and deal huge area damage to the enemy. She is typically played in the middle lane as a ganker and semi-carry, with her ability to appear in battle and deal damage in quick succession, as well as hunt down fleeing heroes with ease. Her Blink ability is the lynchpin of her skill set, allowing her to enter and leave fights at her whim. Once in position to attack, Akasha can unleash her Scream of Pain and Sonic Wave, able to devastate an entire team at once. Chasing down straggling prey is another of her fortes, with Shadow Strike crippling their ability to escape. Akasha is very adept at getting kills early in the game, and transitions very well into a semi-carry if she acquires the proper items.\n",
        "name": "Queen of Pain"
    },
    {
        "description": "Rubick, the Grand Magus, is a ranged intelligence hero best known for his ability to copy the spells of his enemies and use them as his own. Although he is mostly played as a support and is extremely fragile the entire length of the game, he can still prove to be one of the most influential heroes if he utilizes good positioning and well-timed usage of his ultimate, Spell Steal. Spell Steal allows Rubick to cast an enemy hero's most recently used spell, giving him supreme versatility throughout the game. By stealing the right abilities, the Grand Magus can aid himself and allies by casting crippling disables, applying curses, unleashing powerful nukes, disorienting the enemy team, supporting his allies with buffs, escaping from rough situations, or even enhancing his own physical attacks. His other abilities are just as worthy of a Magus: Telekinesis lets Rubick magically lift an enemy into the air, rendering the target helpless and vulnerable, before hurling the lifted enemy to the ground up to a short distance away and stunning nearby foes on impact. Fade Bolt blasts enemies with a stream of arcane energy which bounces to all enemies nearby, dealing damage and reducing their attack damage. Arcane Supremacy is a passive ability, which increases cast range and amplifies the spell damage of Rubick's stolen spells. Rubick's versatile ability-set and his infamous Spell Steal make him a flexible and powerful hero that can work in any lineup although he does suffer from long cooldowns and the surfacing predictability of his ultimate.\n",
        "name": "Rubick"
    },
    {
        "description": "Shadow Demon is a menacing ranged intelligence hero who is most powerful in the early game for his strong set of spells. Disruption takes an enemy or ally out of the fight, banishing them to a shadowy realm and returning them a short time later along with two hostile demonic illusions. Soul Catcher can curse his victims with vulnerability, instantly removing a fraction of their current health. His Shadow Poison can harass any unfortunate foe he encounters, gradually dealing more damage with each application until the Shadow Demon releases the poison from the target in a powerful, damaging burst. Demonic Purge, his ultimate, is key for securing kills: The Shadow Demon greatly slows his fleeing victim and removes all dispellable buffs, crippling and weakening them, while also applying a Break that disables almost all passive skills when upgraded with Aghanim's Scepter. Heavily reliant on the coordination and effectiveness of his own team, Shadow Demon proves to be incredibly strong as a defensive support by keeping his teammates alive reliably and as an offensive support by amplifying damage and endlessly slowing enemies until they're unable to escape. A formidable ally, who requires little farm to contribute greatly to his team, good positioning and timing from Shadow Demon's spells can make all the difference, and makes for one of the most potentially powerful supports well into the late game.\n",
        "name": "Shadow Demon"
    },
    {
        "description": "Rhasta, the Shadow Shaman, is a ranged intelligence hero mostly played as a pusher and disabler, wielding abilities that make pushing lanes more efficient. When his abilities are used in intelligent combos, he has one of the longest disables in game. He is also capable of disabling multiple enemy heroes, allowing him to initiate encounters as well. Though very supportive in nature, until the late game Rhasta is capable of killing lone enemy heroes with the use of his entire skill set; meaning he is more difficult to gank than most other supports. Playing Rhasta well requires good knowledge of target priority and timing; and some minor micromanagement. His peak is mid-game, but he can continue to wreak havoc on enemies all throughout the match.\n",
        "name": "Shadow Shaman"
    },
    {
        "description": "Nortrom, the Silencer, is a ranged intelligence hero who can be played as a support, carry, or initiator. He is one of the few intelligence heroes that truly benefit from intelligence items and is effective against heroes that rely mostly on spells, as he can silence them while stealing their intelligence and adding it to his own. He is a notorious anti-caster hero who can disrupt the magical abilities of his enemies and cripple spellcasters throughout the game. Arcane Curse slows and causes enemies to lose health for a set duration, but increases with each spell the enemy casts, forcing them to either wait and cast no spell until it expires, or cast spells and prolong the debuff and thus take more damage. Last Word places a curse on Nortrom's target that damages and silences for a long duration if the target casts a spell. If the target does not cast a spell before the curse duration ends the effects are the same. Glaives of Wisdom is an active attack modifier that deals a percentage of Nortrom's intelligence as pure damage, as well as steal intelligence with every attack. On top of that, the glaives also allow him to permanently steal the intelligence of enemy heroes that die near him or are directly killed by him, adding it to his own. This rewards his presence in teamfights, also making his glaives ever stronger as the battle goes on. Nortrom's ultimate, Global Silence, silences all enemy units on the map for a few seconds. A well-timed Global Silence can be used to save yourself or an ally, initiate a teamfight, or ruin the enemy's initiation.\n",
        "name": "Silencer"
    },
    {
        "description": "Dragonus, the Skywrath Mage, is a ranged intelligence hero equipped with tremendously powerful nukes, able to enhance magical damage and thus scales well into late game. However, he is a proverbial glass cannon; while he can bring superb amounts of damage, he is dangerously vulnerable and will most likely meet a swift end if the player isn't careful. Arcane Bolt is his main spell; its damage is based on his current Intelligence level. Concussive Shot blasts the nearest enemy hero, along with nearby units around the foe, slowing them down. The Ancient Seal marks the target with magic amplification and silence, leaving the target vulnerable to magic and unable to cast spells. Skywrath Mage's ultimate Mystic Flare is one of the most dangerous nukes in the game. Enemy heroes caught in this field will suffer massive damage. Its power is split equally among enemy heroes within its radius; if it is used on a single hero, it will deal its full damage potential. His spells are most effective when targeted on a lone hero and thus suffer decreased effectiveness when used on groups.\n",
        "name": "Skywrath Mage"
    },
    {
        "description": "Raijin Thunderkeg, the Storm Spirit, is a ranged intelligence hero who wields the elemental power of lightning. He has high mobility, strong ganking and carrying potential, and very good synergy between his hero abilities.\nStatic Remnant creates an immobile clone of himself that, upon contact with an enemy, shocks all enemies in a small area for damage. It has a very low cooldown, making it a good farming skill. Electric Vortex binds an enemy to himself, drawing it in slowly; at higher levels of the skill, it will always be able to pull the target into a Static Remnant. Overload further supplements this combo by harnessing the excess charge whenever Raijin casts a spell, adding it in the form of magical damage to his next attack and zapping enemies in a radius around the target. Finally, Storm Spirit's ultimate and signature skill is Ball Lightning, in which he transforms into pure energy, sacrificing his own mana to dash quickly around the map in an invulnerable state, inflicting minor damage to foes he impacts as well as giving him an Overload charge. It can be used to initiate and escape long distances with ease.\nSince his ultimate disjoints enemy projectiles and has no cooldown, he can prove to be one of the most slippery foes in the game, provided that he has enough mana regeneration to sustain it and/or the enemy team does not have strong disables such as stuns and silences. However, without proper mana management, he will run out of juice very quickly and become a sitting duck. While extremely vulnerable early game before he acquires his ultimate, once he does so, if he gets a few quick kills and some mana-sustaining items, he will become an unstoppable force of nature.\n",
        "name": "Storm Spirit"
    },
    {
        "description": "Squee, Spleen, and Spoon, the Techies, are a trio of ranged intelligence heroes, known for laying deadly traps around the field with a wide array of mines.\nHaving little direct combat ability, the Techies have an unorthodox, if effective, method of dealing damage to the enemy team in the form of powerful laid explosive mines and stasis traps that enable other heroes to set up a gank or retreat. Their mines, set across key points of the map — and even less conventional locations — are an effective method of denying area and guaranteeing damage if enemies dare to initiate. They have an even more bizarre ability in the form of their Blast Off! which causes them to violently explode and lose half their life but deal massive damage in a moderate area of effect.\nThe unique mechanics of the mines mean that the Techies utilize mechanics not used by any other hero, including preemptive mine clusters and such strong area denial that they actively play a large role in securing the area controlled by friendly heroes. The Techies have statistics aligned to those of semi-carries, but play a largely passive, defensive role throughout the game.\n",
        "name": "Techies"
    },
    {
        "description": "Boush, the Tinker, is a ranged intelligence hero who leverages great mobility and blistering nukes to push lanes and gank his enemies. Tinker's ultimate Rearm resets the cooldown on his items and abilities, allowing him to deal prodigious damage with his Laser, Heat-Seeking Missiles and with items such as Dagon. By refreshing Blink Dagger, Rearm also grants Tinker vast mobility, enabling him to pressure multiple lanes with his March of the Machines. Tinker's mana costs are very high, however, so to remain a global threat he must regularly regenerate at his fountain. His mana dependency and modest stat gain make quickly acquiring Boots of Travel a key to success. When played with the right items, good mana management and mechanical skill, there are few heroes Tinker will not evaporate.\n",
        "name": "Tinker"
    },
    {
        "description": "Visage, the bound form of Necro'lic, is a ranged intelligence hero whose traits are unusual when compared to most intelligence heroes; he can be a ganker, tank, or nuker. Resilient and ruthless, Visage is a highly aggressive hero thanks to his great Strength gain and Gravekeeper's Cloak which allow him to soak up surprising amounts of damage. This is especially true from attacks mounted by Heroes who try to chip at his health with spells and burst damage without committing to a protracted engagement. This unholy gargoyle thrives in the midst of large battles, where the abundant pain and suffering in the air charges his Soul Assumption, allowing him to fire off huge bursts of magical damage in rapid succession. Additionally, Visage's proficiency with attacks is augmented by his ability to absorb the attack and movement speed of his foes with Grave Chill. Finally, his versatile ultimate, Familiars, is arguably one of the best scouting utilities in the game while also being excellent sources of damage and AoE disables. Utilizing his Familiars to their fullest requires constant split attention and good positioning to avoid feeding their large bounties to an enemy Hero. With a legion of ghostly gargoyles, incredible toughness, and fast attacks, Visage sows terror and agony, relentlessly hunting poor souls and leading them in the shackles of death to the gates of the Underscape.\n",
        "name": "Visage"
    },
    {
        "description": "Inai, the Void Spirit, is a melee intelligence hero that relies on the element of surprise to blast apart foes with the power of the void. He plays like no other hero, relying on a wide variety of skills that allow him to put his enemies out of position while quickly jumping in and out of combat. Using his Aether Remnants, Inai can start and end any fight in seconds by forcing enemies to attack remnants of himself that guard from all angles. The void is both sword and shield for Void Spirit, whether he takes a quick repose in the aether to teleport to an area of his choice with explosive force, or shields himself in volatile energy that slays the weak and nullifies the attacks of the mighty. Should anything manage to survive the Void Spirit's onslaught, he calls upon his mastery of the ultimate Astral Step technique, dashing through space and time to attack and mark enemies for death not once, but twice.\n",
        "name": "Void Spirit"
    },
    {
        "description": "Demnok Lannik, the Warlock, is a ranged intelligence hero who possesses many powerful teamfight spells capable of inflicting chaos upon the enemy team. Shadow Word is a highly versatile spell, as it allows him to support allies by healing them or harass enemies by dealing damage over time, giving him strong lane presence. Beyond the early game, Warlock can turn any teamfight in his team's favor as his other spells are strong when unleashed against multiple enemies. Fatal Bonds causes all enemies linked together to take bonus damage when one of their number takes damage, magnifying the strength of area-of-effect spells, while Upheaval can allow him to greatly slow any enemies caught in the radius of the spell, making it harder for them to maneuver in fights or escape. His ultimate, Chaotic Offering, summons a Golem after stunning all enemies in a wide area, allowing him to throw them into disarray. While unassuming and weak by himself, Warlock is a dangerous threat in any teamfight as his spells allow him to turn the enemies' numbers against them and sow chaos amongst their ranks.\n",
        "name": "Warlock"
    },
    {
        "description": "Lyralei, the Windranger, is a ranged intelligence hero that uses powerful abilities in conjunction with her physical attack to take down enemies. Despite being an intelligence Hero, Windranger's playstyle resembles that of an agility Hero, due in large part to her skill set. Windranger is most often played as an offlane solo due to her escape, long range harass, and farm capability; however, she is quite versatile and can be fielded as a midlaner, roamer, lane support, or even a carry, if the game calls for it. She is famous for her immense utility and versatility.\n",
        "name": "Windranger"
    },
    {
        "description": "Auroth, the Winter Wyvern, is a ranged intelligence hero whose arsenal of spells gives her powerful nuking capabilities. Usually played as a lane support, Winter Wyvern's spells allow her to fulfill a myriad of roles depending on what her team needs. Arctic Burn grants her temporarily flying movement, increased attack range as well as night vision while causing her attacks to slow enemies and burn their health over time, allowing her to gank and harass with ease. Splinter Blast is a low-cooldown nuke that, while leaving its target unaffected, slows and deals tremendous damage to all other nearby enemies. Cold Embrace allows Winter Wyvern to encase a target ally within a protective layer of ice, disabling them for the duration of the spell but also rendering them immune to physical damage while healing them for a percentage of their maximum health. Her ultimate, Winter's Curse, turns the enemies' own weapons against them by stunning the target enemy while forcing all of their nearby allies to attack them. A fearsome ganker and powerful nuker, Winter Wyvern can chill her foes to the bone and wreak havoc on their ranks.\n",
        "name": "Winter Wyvern"
    },
    {
        "description": "Zharvakko, the Witch Doctor, is a ranged intelligence hero who can take on the role of a support or a ganker. A master of voodoo curses and healing arts, he possesses several positioning-dependent crowd control/damage spells as well as a heal that scales well into the late game. Maledict is one of the most powerful damaging spells in the game, and is fittingly enough quite hard to hit properly – but when applied at the right time, Malediction can curse someone to suffer a slow, humiliating death as they limp back towards safety. Paralyzing Cask is a somewhat-unreliable stun that requires multiple enemies to bounce between to be effective, but can provide a barrage of stuns to the enemy team if they are grouped together. Death Ward has the potential to be one of the most damaging ultimates in the game as long as he is able to channel the spell uninterrupted.\n",
        "name": "Witch Doctor"
    },
    {
        "description": "Zeus, the Lord of Heaven, is a ranged intelligence hero who functions almost solely as a nuker. He is usually played as a semi-carry ganker type hero, who instead of utilizing disables, focuses solely on delivering tremendous amounts of magical damage to his foes. With the high cast range, and ease of use and low cooldown on his spells, he is able to deliver the most superb and consistent magical damage of any hero in the game. Arc Lightning is a highly spammable nuke that creates a stream of lightning that bounces between enemy foes (up to fifteen times at max level), dealing minor damage. Lightning Bolt is more focused, dealing heavy damage to a single target, also on a very low cooldown. It can also be targeted on the ground, providing vision and True Sight and potentially striking a nearby enemy, making him effective even against fogged and invisible enemies as well and allowing him to locate enemy wards. Static Field is a potent passive ability that allows Zeus's magical damage to scale into late game, dealing damage to all enemies equal to a certain percentage of their' health whenever he hits them with a spell. Finally, his ultimate Thundergod's Wrath allows him to strike all enemy heroes with a bolt of lightning, no matter their position, inflicting heavy damage. It can be used for multiple purposes: to finish off low-health enemy heroes limping away, to soften up the entire enemy team during a teamfight, or even to scout out the enemy's position. With the ability to strike down enemies both near and afar, the Lord of Heaven ensures that nobody can escape his wrath.\n",
        "name": "Zeus"
    }
]